{
    "pokemon": {
        "001": {
            "flavor": "Bulbasaur can be seen napping in bright sunlight.\nThere is a seed on its back. By soaking up the sun’s rays,\nthe seed grows progressively larger.",
            "name_en": "bulbasaur",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "002": {
            "flavor": "There is a bud on this Pokémon’s back. To support its weight,\nIvysaur’s legs and trunk grow thick and strong.\nIf it starts spending more time lying in the sunlight,\nit’s a sign that the bud will bloom into a large flower soon.",
            "name_en": "ivysaur",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "003": {
            "flavor": "There is a large flower on Venusaur’s back. The flower is said\nto take on vivid colors if it gets plenty of nutrition and sunlight.\nThe flower’s aroma soothes the emotions of people.",
            "name_en": "venusaur",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "004": {
            "flavor": "The flame that burns at the tip of its tail is an indication\nof its emotions. The flame wavers when Charmander\nis enjoying itself. If the Pokémon becomes enraged,\nthe flame burns fiercely.",
            "name_en": "charmander",
            "types": [
                "Fire"
            ]
        },
        "005": {
            "flavor": "Charmeleon mercilessly destroys its foes using its sharp\nclaws. If it encounters a strong foe, it turns aggressive.\nIn this excited state, the flame at the tip of its tail flares with\na bluish white color.",
            "name_en": "charmeleon",
            "types": [
                "Fire"
            ]
        },
        "006": {
            "flavor": "Charizard flies around the sky in search of powerful opponents.\nIt breathes fire of such great heat that it melts anything.\nHowever, it never turns its fiery breath on any opponent\nweaker than itself.",
            "name_en": "charizard",
            "types": [
                "Fire",
                "Flying"
            ]
        },
        "007": {
            "flavor": "Squirtle’s shell is not merely used for protection.\nThe shell’s rounded shape and the grooves on its\nsurface help minimize resistance in water,\nenabling this Pokémon to swim at high speeds.",
            "name_en": "squirtle",
            "types": [
                "Water"
            ]
        },
        "008": {
            "flavor": "Its tail is large and covered with a rich, thick fur. The tail\nbecomes increasingly deeper in color as Wartortle ages.\nThe scratches on its shell are evidence of this Pokémon’s\ntoughness as a battler.",
            "name_en": "wartortle",
            "types": [
                "Water"
            ]
        },
        "009": {
            "flavor": "Blastoise has water spouts that protrude from its shell.\nThe water spouts are very accurate.\nThey can shoot bullets of water with enough accuracy\nto strike empty cans from a distance of over 160 feet.",
            "name_en": "blastoise",
            "types": [
                "Water"
            ]
        },
        "010": {
            "flavor": "Caterpie has a voracious appetite. It can devour leaves\nbigger than its body right before your eyes. From its antenna,\nthis Pokémon releases a terrifically strong odor.",
            "name_en": "caterpie",
            "types": [
                "Bug"
            ]
        },
        "011": {
            "flavor": "The shell covering this Pokémon’s body is as hard as an\niron slab. Metapod does not move very much.\nIt stays still because it is preparing its soft innards for\nevolution inside the hard shell.",
            "name_en": "metapod",
            "types": [
                "Bug"
            ]
        },
        "012": {
            "flavor": "Butterfree has a superior ability to search for delicious honey\nfrom flowers. It can even search out, extract, and carry honey\nfrom flowers that are blooming over six miles from its nest.",
            "name_en": "butterfree",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "013": {
            "flavor": "Weedle has an extremely acute sense of smell. It is capable\nof distinguishing its favorite kinds of leaves from those it\ndislikes just by sniffing with its big red proboscis (nose).",
            "name_en": "weedle",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "014": {
            "flavor": "Kakuna remains virtually immobile as it clings to a tree.\nHowever, on the inside, it is extremely busy as it prepares\nfor its coming evolution.\nThis is evident from how hot the shell becomes to the touch.",
            "name_en": "kakuna",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "015": {
            "flavor": "Beedrill is extremely territorial. No one should ever approach\nits nest—this is for their own safety. If angered, they will attack\nin a furious swarm.",
            "name_en": "beedrill",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "016": {
            "flavor": "Pidgey has an extremely sharp sense of direction.\nIt is capable of unerringly returning home to its nest,\nhowever far it may be removed from its familiar surroundings.",
            "name_en": "pidgey",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "017": {
            "flavor": "Pidgeotto claims a large area as its own territory. This\nPokémon flies around, patrolling its living space. If its territory\nis violated, it shows no mercy in thoroughly punishing the foe\nwith its sharp claws.",
            "name_en": "pidgeotto",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "018": {
            "flavor": "This Pokémon has a dazzling plumage of beautifully\nglossy feathers. Many Trainers are captivated by the\nstriking beauty of the feathers on its head, compelling\nthem to choose Pidgeot as their Pokémon.",
            "name_en": "pidgeot",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "019": {
            "flavor": "Rattata is cautious in the extreme. Even while it is asleep,\nit constantly listens by moving its ears around. It is not\npicky about where it lives—it will make its nest anywhere.",
            "name_en": "rattata",
            "types": [
                "Normal"
            ]
        },
        "020": {
            "flavor": "Raticate’s sturdy fangs grow steadily. To keep them\nground down, it gnaws on rocks and logs. It may\neven chew on the walls of houses.",
            "name_en": "raticate",
            "types": [
                "Normal"
            ]
        },
        "021": {
            "flavor": "Spearow has a very loud cry that can be heard over\nhalf a mile away. If its high, keening cry is heard echoing all\naround, it is a sign that they are warning each other of danger.",
            "name_en": "spearow",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "022": {
            "flavor": "Fearow is recognized by its long neck and elongated beak.\nThey are conveniently shaped for catching prey in soil or\nwater. It deftly moves its long and skinny beak to pluck prey.",
            "name_en": "fearow",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "023": {
            "flavor": "Ekans curls itself up in a spiral while it rests. Assuming this\nposition allows it to quickly respond to a threat from any\ndirection with a glare from its upraised head.",
            "name_en": "ekans",
            "types": [
                "Poison"
            ]
        },
        "024": {
            "flavor": "This Pokémon is terrifically strong in order to constrict things\nwith its body. It can even flatten steel oil drums. Once Arbok\nwraps its body around its foe, escaping its crunching embrace\nis impossible.",
            "name_en": "arbok",
            "types": [
                "Poison"
            ]
        },
        "025": {
            "flavor": "This Pokémon has electricity-storing pouches on its cheeks.\nThese appear to become electrically charged during the night\nwhile Pikachu sleeps. It occasionally discharges electricity\nwhen it is dozy after waking up.",
            "name_en": "pikachu",
            "types": [
                "Electric"
            ]
        },
        "026": {
            "flavor": "This Pokémon exudes a weak electrical charge from all over\nits body that makes it take on a slight glow in darkness.\nRaichu plants its tail in the ground to discharge electricity.",
            "name_en": "raichu",
            "types": [
                "Electric"
            ]
        },
        "027": {
            "flavor": "Sandshrew has a very dry hide that is extremely tough.\nThe Pokémon can roll into a ball that repels any attack.\nAt night, it burrows into the desert sand to sleep.",
            "name_en": "sandshrew",
            "types": [
                "Ground"
            ]
        },
        "028": {
            "flavor": "Sandslash can roll up its body as if it were a ball covered\nwith large spikes. In battle, this Pokémon will try to make\nthe foe flinch by jabbing it with its spines. It then leaps at\nthe stunned foe to tear wildly with its sharp claws.",
            "name_en": "sandslash",
            "types": [
                "Ground"
            ]
        },
        "029": {
            "flavor": "Nidoran♀ has barbs that secrete a powerful poison.\nThey are thought to have developed as protection for\nthis small-bodied Pokémon. When enraged, it releases\na horrible toxin from its horn.",
            "name_en": "nidoranâ™€",
            "types": [
                "Poison"
            ]
        },
        "030": {
            "flavor": "When Nidorina are with their friends or family, they keep\ntheir barbs tucked away to prevent hurting each other.\nThis Pokémon appears to become nervous if separated\nfrom the others.",
            "name_en": "nidorina",
            "types": [
                "Poison"
            ]
        },
        "031": {
            "flavor": "Nidoqueen’s body is encased in extremely hard scales.\nIt is adept at sending foes flying with harsh tackles. This\nPokémon is at its strongest when it is defending its young.",
            "name_en": "nidoqueen",
            "types": [
                "Poison",
                "Ground"
            ]
        },
        "032": {
            "flavor": "Nidoran♂ has developed muscles for moving its ears. Thanks\nto them, the ears can be freely moved in any direction. Even\nthe slightest sound does not escape this Pokémon’s notice.",
            "name_en": "nidoranâ™‚",
            "types": [
                "Poison"
            ]
        },
        "033": {
            "flavor": "Nidorino has a horn that is harder than a diamond. If it senses\na hostile presence, all the barbs on its back bristle up at once,\nand it challenges the foe with all its might.",
            "name_en": "nidorino",
            "types": [
                "Poison"
            ]
        },
        "034": {
            "flavor": "Nidoking’s thick tail packs enormously destructive power.\nWith one swing, it can topple a metal transmission tower. Once\nthis Pokémon goes on a rampage, there is no stopping it.",
            "name_en": "nidoking",
            "types": [
                "Poison",
                "Ground"
            ]
        },
        "035": {
            "flavor": "On every night of a full moon, groups of this Pokémon\ncome out to play. When dawn arrives, the tired Clefairy\nreturn to their quiet mountain retreats and go to sleep\nnestled up against each other.",
            "name_en": "clefairy",
            "types": [
                "Fairy"
            ]
        },
        "036": {
            "flavor": "Clefable moves by skipping lightly as if it were flying using\nits wings. Its bouncy step lets it even walk on water.\nIt is known to take strolls on lakes on quiet, moonlit nights.",
            "name_en": "clefable",
            "types": [
                "Fairy"
            ]
        },
        "037": {
            "flavor": "Inside Vulpix’s body burns a flame that never goes out.\nDuring the daytime, when the temperatures rise, this\nPokémon releases flames from its mouth to prevent its\nbody from growing too hot.",
            "name_en": "vulpix",
            "types": [
                "Fire"
            ]
        },
        "038": {
            "flavor": "Legend has it that Ninetales came into being when\nnine wizards possessing sacred powers merged into one.\nThis Pokémon is highly intelligent—it can understand\nhuman speech.",
            "name_en": "ninetales",
            "types": [
                "Fire"
            ]
        },
        "039": {
            "flavor": "When this Pokémon sings, it never pauses to breathe.\nIf it is in a battle against an opponent that does not easily\nfall asleep, Jigglypuff cannot breathe, endangering its life.",
            "name_en": "jigglypuff",
            "types": [
                "Normal",
                "Fairy"
            ]
        },
        "040": {
            "flavor": "Wigglytuff’s body is very flexible. By inhaling deeply,\nthis Pokémon can inflate itself seemingly without end.\nOnce inflated, Wigglytuff bounces along lightly like a balloon.",
            "name_en": "wigglytuff",
            "types": [
                "Normal",
                "Fairy"
            ]
        },
        "041": {
            "flavor": "Zubat avoids sunlight because exposure causes it to become\nunhealthy. During the daytime, it stays in caves or under\nthe eaves of old houses, sleeping while hanging upside down.",
            "name_en": "zubat",
            "types": [
                "Poison",
                "Flying"
            ]
        },
        "042": {
            "flavor": "Golbat bites down on prey with its four fangs and drinks\nthe victim’s blood. It becomes active on inky dark\nmoonless nights, flying around to attack people and Pokémon.",
            "name_en": "golbat",
            "types": [
                "Poison",
                "Flying"
            ]
        },
        "043": {
            "flavor": "Oddish searches for fertile, nutrient-rich soil, then plants itself.\nDuring the daytime, while it is planted, this Pokémon’s feet\nare thought to change shape and become similar to the roots\nof trees.",
            "name_en": "oddish",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "044": {
            "flavor": "From its mouth Gloom drips honey that smells absolutely\nhorrible. Apparently, it loves the horrid stench. It sniffs the\nnoxious fumes and then drools even more of its honey.",
            "name_en": "gloom",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "045": {
            "flavor": "Vileplume has the world’s largest petals. They are used to\nattract prey that are then doused with toxic spores. Once the\nprey are immobilized, this Pokémon catches and devours them.",
            "name_en": "vileplume",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "046": {
            "flavor": "Paras has parasitic mushrooms growing on its back called\ntochukaso. They grow large by drawing nutrients from this\nBug Pokémon host. They are highly valued as a medicine\nfor extending life.",
            "name_en": "paras",
            "types": [
                "Bug",
                "Grass"
            ]
        },
        "047": {
            "flavor": "Parasect is known to infest large trees en masse and drain\nnutrients from the lower trunk and roots. When an infested\ntree dies, they move onto another tree all at once.",
            "name_en": "parasect",
            "types": [
                "Bug",
                "Grass"
            ]
        },
        "048": {
            "flavor": "Venonat is said to have evolved with a coat of thin, stiff hair\nthat covers its entire body for protection. It possesses large\neyes that never fail to spot even minuscule prey.",
            "name_en": "venonat",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "049": {
            "flavor": "Venomoth is nocturnal—it is a Pokémon that only becomes\nactive at night. Its favorite prey are small insects that gather\naround streetlights, attracted by the light in the darkness.",
            "name_en": "venomoth",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "050": {
            "flavor": "Diglett are raised in most farms. The reason is simple—\nwherever this Pokémon burrows, the soil is left perfectly tilled\nfor planting crops. This soil is made ideal for growing\ndelicious vegetables.",
            "name_en": "diglett",
            "types": [
                "Ground"
            ]
        },
        "051": {
            "flavor": "Dugtrio are actually triplets that emerged from one body.\nAs a result, each triplet thinks exactly like the other two\ntriplets. They work cooperatively to burrow endlessly.",
            "name_en": "dugtrio",
            "types": [
                "Ground"
            ]
        },
        "052": {
            "flavor": "Meowth withdraws its sharp claws into its paws to slinkily sneak\nabout without making any incriminating footsteps. For some\nreason, this Pokémon loves shiny coins that glitter with light.",
            "name_en": "meowth",
            "types": [
                "Normal"
            ]
        },
        "053": {
            "flavor": "Persian has six bold whiskers that give it a look of toughness.\nThe whiskers sense air movements to determine what is in the\nPokémon’s surrounding vicinity. It becomes docile if grabbed\nby the whiskers.",
            "name_en": "persian",
            "types": [
                "Normal"
            ]
        },
        "054": {
            "flavor": "If it uses its mysterious power, Psyduck can’t remember\nhaving done so. It apparently can’t form a memory of such\nan event because it goes into an altered state that is much\nlike deep sleep.",
            "name_en": "psyduck",
            "types": [
                "Water"
            ]
        },
        "055": {
            "flavor": "Golduck is the fastest swimmer among all Pokémon. It swims\neffortlessly, even in a rough, stormy sea. It sometimes rescues\npeople from wrecked ships floundering in high seas.",
            "name_en": "golduck",
            "types": [
                "Water"
            ]
        },
        "056": {
            "flavor": "When Mankey starts shaking and its nasal breathing turns\nrough, it’s a sure sign that it is becoming angry. However,\nbecause it goes into a towering rage almost instantly,\nit is impossible for anyone to flee its wrath.",
            "name_en": "mankey",
            "types": [
                "Fighting"
            ]
        },
        "057": {
            "flavor": "When Primeape becomes furious, its blood circulation\nis boosted. In turn, its muscles are made even stronger.\nHowever, it also becomes much less intelligent at the\nsame time.",
            "name_en": "primeape",
            "types": [
                "Fighting"
            ]
        },
        "058": {
            "flavor": "Growlithe has a superb sense of smell. Once it smells anything,\nthis Pokémon won’t forget the scent, no matter what. It uses\nits advanced olfactory sense to determine the emotions of\nother living things.",
            "name_en": "growlithe",
            "types": [
                "Fire"
            ]
        },
        "059": {
            "flavor": "Arcanine is known for its high speed. It is said to be capable\nof running over 6,200 miles in a single day and night. The\nfire that blazes wildly within this Pokémon’s body is its source\nof power.",
            "name_en": "arcanine",
            "types": [
                "Fire"
            ]
        },
        "060": {
            "flavor": "Poliwag has a very thin skin. It is possible to see the\nPokémon’s spiral innards right through the skin. Despite its\nthinness, however, the skin is also very flexible. Even sharp\nfangs bounce right off it.",
            "name_en": "poliwag",
            "types": [
                "Water"
            ]
        },
        "061": {
            "flavor": "The surface of Poliwhirl’s body is always wet and slick with\na slimy fluid. Because of this slippery covering, it can easily\nslip and slide out of the clutches of any enemy in battle.",
            "name_en": "poliwhirl",
            "types": [
                "Water"
            ]
        },
        "062": {
            "flavor": "Poliwrath’s highly developed, brawny muscles never grow\nfatigued, however much it exercises. It is so tirelessly strong,\nthis Pokémon can swim back and forth across the ocean\nwithout effort.",
            "name_en": "poliwrath",
            "types": [
                "Water",
                "Fighting"
            ]
        },
        "063": {
            "flavor": "Abra needs to sleep for eighteen hours a day. If it doesn’t,\nthis Pokémon loses its ability to use telekinetic powers. If it is\nattacked, Abra escapes using Teleport while it is still sleeping.",
            "name_en": "abra",
            "types": [
                "Psychic"
            ]
        },
        "064": {
            "flavor": "Kadabra holds a silver spoon in its hand. The spoon is used\nto amplify the alpha waves in its brain. Without the spoon, the\nPokémon is said to be limited to half the usual amount of its\ntelekinetic powers.",
            "name_en": "kadabra",
            "types": [
                "Psychic"
            ]
        },
        "065": {
            "flavor": "Alakazam’s brain continually grows, infinitely multiplying\nbrain cells. This amazing brain gives this Pokémon an\nastoundingly high IQ of 5,000. It has a thorough memory\nof everything that has occurred in the world.",
            "name_en": "alakazam",
            "types": [
                "Psychic"
            ]
        },
        "066": {
            "flavor": "Machop exercises by hefting around a Graveler as if it were\na barbell. There are some Machop that travel the world in a\nquest to master all kinds of martial arts.",
            "name_en": "machop",
            "types": [
                "Fighting"
            ]
        },
        "067": {
            "flavor": "Machoke undertakes bodybuilding every day even as\nit helps people with tough, physically demanding labor.\nOn its days off, this Pokémon heads to the fields and\nmountains to exercise and train.",
            "name_en": "machoke",
            "types": [
                "Fighting"
            ]
        },
        "068": {
            "flavor": "Machamp is known as the Pokémon that has mastered\nevery kind of martial arts. If it grabs hold of the foe with its\nfour arms, the battle is all but over. The hapless foe is thrown\nfar over the horizon.",
            "name_en": "machamp",
            "types": [
                "Fighting"
            ]
        },
        "069": {
            "flavor": "Bellsprout’s thin and flexible body lets it bend and sway\nto avoid any attack, however strong it may be. From its mouth,\nthis Pokémon spits a corrosive fluid that melts even iron.",
            "name_en": "bellsprout",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "070": {
            "flavor": "Weepinbell has a large hook on its rear end. At night, the\nPokémon hooks on to a tree branch and goes to sleep.\nIf it moves around in its sleep, it may wake up to find itself\non the ground.",
            "name_en": "weepinbell",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "071": {
            "flavor": "Victreebel has a long vine that extends from its head.\nThis vine is waved and flicked about as if it were an animal\nto attract prey. When an unsuspecting prey draws near,\nthis Pokémon swallows it whole.",
            "name_en": "victreebel",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "072": {
            "flavor": "Tentacool absorbs sunlight and refracts it using water inside\nits body to convert it into beam energy. This Pokémon shoots\nbeams from the small round organ above its eyes.",
            "name_en": "tentacool",
            "types": [
                "Water",
                "Poison"
            ]
        },
        "073": {
            "flavor": "Tentacruel has tentacles that can be freely elongated\nand shortened at will. It ensnares prey with its tentacles\nand weakens the prey by dosing it with a harsh toxin.\nIt can catch up to 80 prey at the same time.",
            "name_en": "tentacruel",
            "types": [
                "Water",
                "Poison"
            ]
        },
        "074": {
            "flavor": "When Geodude sleeps deeply, it buries itself halfway into the\nground. It will not awaken even if hikers step on it unwittingly.\nIn the morning, this Pokémon rolls downhill in search of food.",
            "name_en": "geodude",
            "types": [
                "Rock",
                "Ground"
            ]
        },
        "075": {
            "flavor": "Rocks are Graveler’s favorite food. This Pokémon will climb a\nmountain from the base to the summit, crunchingly feasting on\nrocks all the while. Upon reaching the peak, it rolls back down\nto the bottom.",
            "name_en": "graveler",
            "types": [
                "Rock",
                "Ground"
            ]
        },
        "076": {
            "flavor": "Golem is known for rolling down from mountains. To prevent\nthem from rolling into the homes of people downhill, grooves\nhave been dug into the sides of mountains to serve as\nguideways for diverting this Pokémon’s course.",
            "name_en": "golem",
            "types": [
                "Rock",
                "Ground"
            ]
        },
        "077": {
            "flavor": "Ponyta is very weak at birth. It can barely stand up.\nThis Pokémon becomes stronger by stumbling and\nfalling to keep up with its parent.",
            "name_en": "ponyta",
            "types": [
                "Fire"
            ]
        },
        "078": {
            "flavor": "Rapidash usually can be seen casually cantering in the fields\nand plains. However, when this Pokémon turns serious, its\nfiery manes flare and blaze as it gallops its way up to 150 mph.",
            "name_en": "rapidash",
            "types": [
                "Fire"
            ]
        },
        "079": {
            "flavor": "Slowpoke uses its tail to catch prey by dipping it in water\nat the side of a river. However, this Pokémon often forgets\nwhat it’s doing and often spends entire days just loafing\nat water’s edge.",
            "name_en": "slowpoke",
            "types": [
                "Water",
                "Psychic"
            ]
        },
        "080": {
            "flavor": "Slowbro’s tail has a Shellder firmly attached with a bite.\nAs a result, the tail can’t be used for fishing anymore. This\ncauses Slowbro to grudgingly swim and catch prey instead.",
            "name_en": "slowbro",
            "types": [
                "Water",
                "Psychic"
            ]
        },
        "081": {
            "flavor": "Magnemite floats in the air by emitting electromagnetic waves\nfrom the units at its sides. These waves block gravity. This\nPokémon becomes incapable of flight if its internal electrical\nsupply is depleted.",
            "name_en": "magnemite",
            "types": [
                "Electric",
                "Steel"
            ]
        },
        "082": {
            "flavor": "Magneton emits a powerful magnetic force that is fatal to\nelectronics and precision instruments. Because of this, it is\nsaid that some towns warn people to keep this Pokémon\ninside a Poké Ball.",
            "name_en": "magneton",
            "types": [
                "Electric",
                "Steel"
            ]
        },
        "083": {
            "flavor": "Farfetch’d is always seen with a stalk from a plant of some\nsort. Apparently, there are good stalks and bad stalks. This\nPokémon has been known to fight with others over stalks.",
            "name_en": "farfetch'd",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "084": {
            "flavor": "Doduo’s two heads contain completely identical brains. A\nscientific study reported that on rare occasions, there will be\nexamples of this Pokémon possessing different sets of brains.",
            "name_en": "doduo",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "085": {
            "flavor": "Apparently, the heads aren’t the only parts of the body that\nDodrio has three of. It has three sets of hearts and lungs as\nwell, so it is capable of running long distances without rest.",
            "name_en": "dodrio",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "086": {
            "flavor": "Seel hunts for prey in the frigid sea underneath sheets of ice.\nWhen it needs to breathe, it punches a hole through the ice\nwith the sharply protruding section of its head.",
            "name_en": "seel",
            "types": [
                "Water"
            ]
        },
        "087": {
            "flavor": "Dewgong loves to snooze on bitterly cold ice. The sight of\nthis Pokémon sleeping on a glacier was mistakenly thought\nto be a mermaid by a mariner long ago.",
            "name_en": "dewgong",
            "types": [
                "Water",
                "Ice"
            ]
        },
        "088": {
            "flavor": "Grimer emerged from the sludge that settled on a polluted\nseabed. This Pokémon loves anything filthy. It constantly\nleaks a horribly germ-infested fluid from all over its body.",
            "name_en": "grimer",
            "types": [
                "Poison"
            ]
        },
        "089": {
            "flavor": "This Pokémon’s favorite food is anything that is repugnantly\nfilthy. In dirty towns where people think nothing of throwing\naway litter on the streets, Muk are certain to gather.",
            "name_en": "muk",
            "types": [
                "Poison"
            ]
        },
        "090": {
            "flavor": "At night, this Pokémon uses its broad tongue to burrow a hole\nin the seafloor sand and then sleep in it. While it is sleeping,\nShellder closes its shell, but leaves its tongue hanging out.",
            "name_en": "shellder",
            "types": [
                "Water"
            ]
        },
        "091": {
            "flavor": "Cloyster is capable of swimming in the sea. It does so by\nswallowing water, then jetting it out toward the rear. This\nPokémon shoots spikes from its shell using the same system.",
            "name_en": "cloyster",
            "types": [
                "Water",
                "Ice"
            ]
        },
        "092": {
            "flavor": "Gastly is largely composed of gaseous matter. When exposed\nto a strong wind, the gaseous body quickly dwindles away.\nGroups of this Pokémon cluster under the eaves of houses to\nescape the ravages of wind.",
            "name_en": "gastly",
            "types": [
                "Ghost",
                "Poison"
            ]
        },
        "093": {
            "flavor": "Haunter is a dangerous Pokémon. If one beckons you while\nfloating in darkness, you must never approach it. This Pokémon\nwill try to lick you with its tongue and steal your life away.",
            "name_en": "haunter",
            "types": [
                "Ghost",
                "Poison"
            ]
        },
        "094": {
            "flavor": "Sometimes, on a dark night, your shadow thrown by a\nstreetlight will suddenly and startlingly overtake you.\nIt is actually a Gengar running past you, pretending to be\nyour shadow.",
            "name_en": "gengar",
            "types": [
                "Ghost",
                "Poison"
            ]
        },
        "095": {
            "flavor": "Onix has a magnet in its brain. It acts as a compass so that\nthis Pokémon does not lose direction while it is tunneling.\nAs it grows older, its body becomes increasingly rounder\nand smoother.",
            "name_en": "onix",
            "types": [
                "Rock",
                "Ground"
            ]
        },
        "096": {
            "flavor": "If your nose becomes itchy while you are sleeping, it’s a sure\nsign that one of these Pokémon is standing above your pillow\nand trying to eat your dream through your nostrils.",
            "name_en": "drowzee",
            "types": [
                "Psychic"
            ]
        },
        "097": {
            "flavor": "Hypno holds a pendulum in its hand. The arcing movement and\nglitter of the pendulum lull the foe into a deep state of\nhypnosis. While this Pokémon searches for prey, it polishes\nthe pendulum.",
            "name_en": "hypno",
            "types": [
                "Psychic"
            ]
        },
        "098": {
            "flavor": "Krabby live on beaches, burrowed inside holes dug into\nthe sand. On sandy beaches with little in the way of food,\nthese Pokémon can be seen squabbling with each other\nover territory.",
            "name_en": "krabby",
            "types": [
                "Water"
            ]
        },
        "099": {
            "flavor": "Kingler has an enormous, oversized claw. It waves this huge\nclaw in the air to communicate with others. However, because\nthe claw is so heavy, the Pokémon quickly tires.",
            "name_en": "kingler",
            "types": [
                "Water"
            ]
        },
        "100": {
            "flavor": "Voltorb is extremely sensitive—it explodes at the slightest\nof shocks. It is rumored that it was first created when a\nPoké Ball was exposed to a powerful pulse of energy.",
            "name_en": "voltorb",
            "types": [
                "Electric"
            ]
        },
        "101": {
            "flavor": "One of Electrode’s characteristics is its attraction to electricity.\nIt is a problematical Pokémon that congregates mostly at\nelectrical power plants to feed on electricity that has just\nbeen generated.",
            "name_en": "electrode",
            "types": [
                "Electric"
            ]
        },
        "102": {
            "flavor": "This Pokémon consists of six eggs that form a closely knit\ncluster. The six eggs attract each other and spin around.\nWhen cracks increasingly appear on the eggs, Exeggcute is\nclose to evolution.",
            "name_en": "exeggcute",
            "types": [
                "Grass",
                "Psychic"
            ]
        },
        "103": {
            "flavor": "Exeggutor originally came from the tropics. Its heads\nsteadily grow larger from exposure to strong sunlight. It is\nsaid that when the heads fall off, they group together to\nform Exeggcute.",
            "name_en": "exeggutor",
            "types": [
                "Grass",
                "Psychic"
            ]
        },
        "104": {
            "flavor": "Cubone pines for the mother it will never see again. Seeing a\nlikeness of its mother in the full moon, it cries. The stains on\nthe skull the Pokémon wears are made by the tears it sheds.",
            "name_en": "cubone",
            "types": [
                "Ground"
            ]
        },
        "105": {
            "flavor": "Marowak is the evolved form of a Cubone that has overcome\nits sadness at the loss of its mother and grown tough. This\nPokémon’s tempered and hardened spirit is not easily broken.",
            "name_en": "marowak",
            "types": [
                "Ground"
            ]
        },
        "106": {
            "flavor": "Hitmonlee’s legs freely contract and stretch. Using these\nspringlike legs, it bowls over foes with devastating kicks.\nAfter battle, it rubs down its legs and loosens the muscles\nto overcome fatigue.",
            "name_en": "hitmonlee",
            "types": [
                "Fighting"
            ]
        },
        "107": {
            "flavor": "Hitmonchan is said to possess the spirit of a boxer who had\nbeen working toward a world championship. This Pokémon\nhas an indomitable spirit and will never give up in the face\nof adversity.",
            "name_en": "hitmonchan",
            "types": [
                "Fighting"
            ]
        },
        "108": {
            "flavor": "Whenever Lickitung comes across something new, it will\nunfailingly give it a lick. It does so because it memorizes things\nby texture and by taste. It is somewhat put off by sour things.",
            "name_en": "lickitung",
            "types": [
                "Normal"
            ]
        },
        "109": {
            "flavor": "Koffing embodies toxic substances. It mixes the toxins with raw\ngarbage to set off a chemical reaction that results in a terribly\npowerful poison gas. The higher the temperature, the more gas\nis concocted by this Pokémon.",
            "name_en": "koffing",
            "types": [
                "Poison"
            ]
        },
        "110": {
            "flavor": "Weezing alternately shrinks and inflates its twin bodies to mix\ntogether toxic gases inside. The more the gases are mixed,\nthe more powerful the toxins become. The Pokémon also\nbecomes more putrid.",
            "name_en": "weezing",
            "types": [
                "Poison"
            ]
        },
        "111": {
            "flavor": "Rhyhorn’s brain is very small. It is so dense, while on a run\nit forgets why it started running in the first place. It apparently\nremembers sometimes if it demolishes something.",
            "name_en": "rhyhorn",
            "types": [
                "Ground",
                "Rock"
            ]
        },
        "112": {
            "flavor": "Rhydon has a horn that serves as a drill. It is used for\ndestroying rocks and boulders. This Pokémon occasionally\nrams into streams of magma, but the armor-like hide prevents\nit from feeling the heat.",
            "name_en": "rhydon",
            "types": [
                "Ground",
                "Rock"
            ]
        },
        "113": {
            "flavor": "Chansey lays nutritionally excellent eggs on an everyday basis.\nThe eggs are so delicious, they are easily and eagerly\ndevoured by even those people who have lost their appetite.",
            "name_en": "chansey",
            "types": [
                "Normal"
            ]
        },
        "114": {
            "flavor": "Tangela’s vines snap off easily if they are grabbed. This\nhappens without pain, allowing it to make a quick getaway.\nThe lost vines are replaced by newly grown vines the very\nnext day.",
            "name_en": "tangela",
            "types": [
                "Grass"
            ]
        },
        "115": {
            "flavor": "If you come across a young Kangaskhan playing by itself,\nyou must never disturb it or attempt to catch it. The baby\nPokémon’s parent is sure to be in the area, and it will\nbecome violently enraged at you.",
            "name_en": "kangaskhan",
            "types": [
                "Normal"
            ]
        },
        "116": {
            "flavor": "If Horsea senses danger, it will reflexively spray a dense\nblack ink from its mouth and try to escape. This Pokémon\nswims by cleverly flapping the fin on its back.",
            "name_en": "horsea",
            "types": [
                "Water"
            ]
        },
        "117": {
            "flavor": "Seadra generates whirlpools by spinning its body.\nThe whirlpools are strong enough to swallow even\nfishing boats. This Pokémon weakens prey with\nthese currents, then swallows it whole.",
            "name_en": "seadra",
            "types": [
                "Water"
            ]
        },
        "118": {
            "flavor": "Goldeen loves swimming wild and free in rivers and ponds.\nIf one of these Pokémon is placed in an aquarium, it will\nshatter even the thickest glass with one ram of its horn\nand make its escape.",
            "name_en": "goldeen",
            "types": [
                "Water"
            ]
        },
        "119": {
            "flavor": "Seaking is very protective of its eggs. The male and female\nwill take turns patrolling around their nest and eggs. The\nguarding of eggs by these Pokémon goes on for over a month.",
            "name_en": "seaking",
            "types": [
                "Water"
            ]
        },
        "120": {
            "flavor": "Staryu apparently communicates with the stars in the night sky\nby flashing the red core at the center of its body. If parts of its\nbody are torn, this Pokémon simply regenerates the missing\npieces and limbs.",
            "name_en": "staryu",
            "types": [
                "Water"
            ]
        },
        "121": {
            "flavor": "Starmie swims through water by spinning its star-shaped\nbody as if it were a propeller on a ship. The core at the\ncenter of this Pokémon’s body glows in seven colors.",
            "name_en": "starmie",
            "types": [
                "Water",
                "Psychic"
            ]
        },
        "122": {
            "flavor": "Mr. Mime is a master of pantomime. Its gestures and motions\nconvince watchers that something unseeable actually exists.\nOnce the watchers are convinced, the unseeable thing exists\nas if it were real.",
            "name_en": "mr. mime",
            "types": [
                "Psychic",
                "Fairy"
            ]
        },
        "123": {
            "flavor": "Scyther is blindingly fast. Its blazing speed enhances the\neffectiveness of the twin scythes on its forearms. This\nPokémon’s scythes are so effective, they can slice through\nthick logs in one wicked stroke.",
            "name_en": "scyther",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "124": {
            "flavor": "Jynx walks rhythmically, swaying and shaking its hips\nas if it were dancing. Its motions are so bouncingly alluring,\npeople seeing it are compelled to shake their hips without\ngiving any thought to what they are doing.",
            "name_en": "jynx",
            "types": [
                "Ice",
                "Psychic"
            ]
        },
        "125": {
            "flavor": "When a storm arrives, gangs of this Pokémon compete with\neach other to scale heights that are likely to be stricken by\nlightning bolts. Some towns use Electabuzz in place of\nlightning rods.",
            "name_en": "electabuzz",
            "types": [
                "Electric"
            ]
        },
        "126": {
            "flavor": "In battle, Magmar blows out intensely hot flames from\nall over its body to intimidate its opponent. This Pokémon’s\nfiery bursts create heat waves that ignite grass and trees in\nits surroundings.",
            "name_en": "magmar",
            "types": [
                "Fire"
            ]
        },
        "127": {
            "flavor": "Pinsir has a pair of massive horns. Protruding from the surface\nof these horns are thorns. These thorns are driven deeply into\nthe foe’s body when the pincer closes, making it tough for the\nfoe to escape.",
            "name_en": "pinsir",
            "types": [
                "Bug"
            ]
        },
        "128": {
            "flavor": "This Pokémon is not satisfied unless it is rampaging at all\ntimes. If there is no opponent for Tauros to battle, it will\ncharge at thick trees and knock them down to calm itself.",
            "name_en": "tauros",
            "types": [
                "Normal"
            ]
        },
        "129": {
            "flavor": "Magikarp is virtually useless in battle as it can only splash\naround. As a result, it is considered to be weak. However,\nit is actually a very hardy Pokémon that can survive in any\nbody of water no matter how polluted it is.",
            "name_en": "magikarp",
            "types": [
                "Water"
            ]
        },
        "130": {
            "flavor": "Once Gyarados goes on a rampage, its ferociously violent\nblood doesn’t calm until it has burned everything down.\nThere are records of this Pokémon’s rampages lasting a\nwhole month.",
            "name_en": "gyarados",
            "types": [
                "Water",
                "Flying"
            ]
        },
        "131": {
            "flavor": "People have driven Lapras almost to the point of extinction.\nIn the evenings, this Pokémon is said to sing plaintively as\nit seeks what few others of its kind still remain.",
            "name_en": "lapras",
            "types": [
                "Water",
                "Ice"
            ]
        },
        "132": {
            "flavor": "Ditto rearranges its cell structure to transform itself into other\nshapes. However, if it tries to transform itself into something\nby relying on its memory, this Pokémon manages to get\ndetails wrong.",
            "name_en": "ditto",
            "types": [
                "Normal"
            ]
        },
        "133": {
            "flavor": "Eevee has an unstable genetic makeup that suddenly mutates\ndue to the environment in which it lives. Radiation from various\nstones causes this Pokémon to evolve.",
            "name_en": "eevee",
            "types": [
                "Normal"
            ]
        },
        "134": {
            "flavor": "Vaporeon underwent a spontaneous mutation and grew fins\nand gills that allow it to live underwater. This Pokémon has\nthe ability to freely control water.",
            "name_en": "vaporeon",
            "types": [
                "Water"
            ]
        },
        "135": {
            "flavor": "Jolteon’s cells generate a low level of electricity. This power\nis amplified by the static electricity of its fur, enabling the\nPokémon to drop thunderbolts. The bristling fur is made of\nelectrically charged needles.",
            "name_en": "jolteon",
            "types": [
                "Electric"
            ]
        },
        "136": {
            "flavor": "Flareon’s fluffy fur has a functional purpose—it releases heat\ninto the air so that its body does not get excessively hot.\nThis Pokémon’s body temperature can rise to a maximum of\n1,650 degrees Fahrenheit.",
            "name_en": "flareon",
            "types": [
                "Fire"
            ]
        },
        "137": {
            "flavor": "Porygon is capable of reverting itself entirely back to program\ndata and entering cyberspace. This Pokémon is copy protected\nso it cannot be duplicated by copying.",
            "name_en": "porygon",
            "types": [
                "Normal"
            ]
        },
        "138": {
            "flavor": "Omanyte is one of the ancient and long-since-extinct Pokémon\nthat have been regenerated from fossils by people. If attacked\nby an enemy, it withdraws itself inside its hard shell.",
            "name_en": "omanyte",
            "types": [
                "Rock",
                "Water"
            ]
        },
        "139": {
            "flavor": "Omastar uses its tentacles to capture its prey. It is\nbelieved to have become extinct because its shell grew too\nlarge and heavy, causing its movements to become too slow\nand ponderous.",
            "name_en": "omastar",
            "types": [
                "Rock",
                "Water"
            ]
        },
        "140": {
            "flavor": "Kabuto is a Pokémon that has been regenerated from a fossil.\nHowever, in extremely rare cases, living examples have\nbeen discovered. The Pokémon has not changed at all for\n300 million years.",
            "name_en": "kabuto",
            "types": [
                "Rock",
                "Water"
            ]
        },
        "141": {
            "flavor": "Kabutops swam underwater to hunt for its prey in ancient\ntimes. The Pokémon was apparently evolving from being a\nwater dweller to living on land as evident from the beginnings\nof change in its gills and legs.",
            "name_en": "kabutops",
            "types": [
                "Rock",
                "Water"
            ]
        },
        "142": {
            "flavor": "Aerodactyl is a Pokémon from the age of dinosaurs. It was\nregenerated from genetic material extracted from amber. It is\nimagined to have been the king of the skies in ancient times.",
            "name_en": "aerodactyl",
            "types": [
                "Rock",
                "Flying"
            ]
        },
        "143": {
            "flavor": "Snorlax’s typical day consists of nothing more than eating and\nsleeping. It is such a docile Pokémon that there are children\nwho use its expansive belly as a place to play.",
            "name_en": "snorlax",
            "types": [
                "Normal"
            ]
        },
        "144": {
            "flavor": "Articuno is a legendary bird Pokémon that can control ice.\nThe flapping of its wings chills the air. As a result, it is said\nthat when this Pokémon flies, snow will fall.",
            "name_en": "articuno",
            "types": [
                "Ice",
                "Flying"
            ]
        },
        "145": {
            "flavor": "Zapdos is a legendary bird Pokémon that has the ability\nto control electricity. It usually lives in thunderclouds.\nThe Pokémon gains power if it is stricken by lightning bolts.",
            "name_en": "zapdos",
            "types": [
                "Electric",
                "Flying"
            ]
        },
        "146": {
            "flavor": "Moltres is a legendary bird Pokémon that has the ability\nto control fire. If this Pokémon is injured, it is said to dip its\nbody in the molten magma of a volcano to burn and heal itself.",
            "name_en": "moltres",
            "types": [
                "Fire",
                "Flying"
            ]
        },
        "147": {
            "flavor": "Dratini continually molts and sloughs off its old skin. It does so\nbecause the life energy within its body steadily builds to reach\nuncontrollable levels.",
            "name_en": "dratini",
            "types": [
                "Dragon"
            ]
        },
        "148": {
            "flavor": "Dragonair stores an enormous amount of energy inside\nits body. It is said to alter weather conditions in its vicinity\nby discharging energy from the crystals on its neck and tail.",
            "name_en": "dragonair",
            "types": [
                "Dragon"
            ]
        },
        "149": {
            "flavor": "Dragonite is capable of circling the globe in just 16 hours.\nIt is a kindhearted Pokémon that leads lost and foundering\nships in a storm to the safety of land.",
            "name_en": "dragonite",
            "types": [
                "Dragon",
                "Flying"
            ]
        },
        "150": {
            "flavor": "Mewtwo is a Pokémon that was created by genetic\nmanipulation. However, even though the scientific power\nof humans created this Pokémon’s body, they failed to\nendow Mewtwo with a compassionate heart.",
            "name_en": "mewtwo",
            "types": [
                "Psychic"
            ]
        },
        "151": {
            "flavor": "Mew is said to possess the genetic composition of all\nPokémon. It is capable of making itself invisible at will,\nso it entirely avoids notice even if it approaches people.",
            "name_en": "mew",
            "types": [
                "Psychic"
            ]
        },
        "152": {
            "flavor": "In battle, Chikorita waves its leaf around to keep the foe at\nbay. However, a sweet fragrance also wafts from the leaf,\nbecalming the battling Pokémon and creating a cozy,\nfriendly atmosphere all around.",
            "name_en": "chikorita",
            "types": [
                "Grass"
            ]
        },
        "153": {
            "flavor": "Bayleef’s neck is ringed by curled-up leaves. Inside each\ntubular leaf is a small shoot of a tree. The fragrance of this\nshoot makes people peppy.",
            "name_en": "bayleef",
            "types": [
                "Grass"
            ]
        },
        "154": {
            "flavor": "The fragrance of Meganium’s flower soothes and calms\nemotions. In battle, this Pokémon gives off more of its\nbecalming scent to blunt the foe’s fighting spirit.",
            "name_en": "meganium",
            "types": [
                "Grass"
            ]
        },
        "155": {
            "flavor": "Cyndaquil protects itself by flaring up the flames on its back.\nThe flames are vigorous if the Pokémon is angry. However, if it\nis tired, the flames splutter fitfully with incomplete combustion.",
            "name_en": "cyndaquil",
            "types": [
                "Fire"
            ]
        },
        "156": {
            "flavor": "Quilava keeps its foes at bay with the intensity of its flames\nand gusts of superheated air. This Pokémon applies its\noutstanding nimbleness to dodge attacks even while scorching\nthe foe with flames.",
            "name_en": "quilava",
            "types": [
                "Fire"
            ]
        },
        "157": {
            "flavor": "Typhlosion obscures itself behind a shimmering heat haze that\nit creates using its intensely hot flames. This Pokémon creates\nblazing explosive blasts that burn everything to cinders.",
            "name_en": "typhlosion",
            "types": [
                "Fire"
            ]
        },
        "158": {
            "flavor": "Despite the smallness of its body, Totodile’s jaws are very\npowerful. While the Pokémon may think it is just playfully\nnipping, its bite has enough power to cause serious injury.",
            "name_en": "totodile",
            "types": [
                "Water"
            ]
        },
        "159": {
            "flavor": "Once Croconaw has clamped its jaws on its foe, it will\nabsolutely not let go. Because the tips of its fangs are\nforked back like barbed fishhooks, they become impossible\nto remove when they have sunk in.",
            "name_en": "croconaw",
            "types": [
                "Water"
            ]
        },
        "160": {
            "flavor": "Feraligatr intimidates its foes by opening its huge mouth.\nIn battle, it will kick the ground hard with its thick and powerful\nhind legs to charge at the foe at an incredible speed.",
            "name_en": "feraligatr",
            "types": [
                "Water"
            ]
        },
        "161": {
            "flavor": "When Sentret sleeps, it does so while another stands guard.\nThe sentry wakes the others at the first sign of danger. When\nthis Pokémon becomes separated from its pack, it becomes\nincapable of sleep due to fear.",
            "name_en": "sentret",
            "types": [
                "Normal"
            ]
        },
        "162": {
            "flavor": "Furret has a very slim build. When under attack, it can slickly\nsquirm through narrow spaces and get away. In spite of its\nshort limbs, this Pokémon is very nimble and fleet.",
            "name_en": "furret",
            "types": [
                "Normal"
            ]
        },
        "163": {
            "flavor": "Hoothoot has an internal organ that senses and tracks the\nearth’s rotation. Using this special organ, this Pokémon\nbegins hooting at precisely the same time every day.",
            "name_en": "hoothoot",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "164": {
            "flavor": "Noctowl never fails at catching prey in darkness. This Pokémon\nowes its success to its superior vision that allows it to see in\nminimal light, and to its soft, supple wings that make no sound\nin flight.",
            "name_en": "noctowl",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "165": {
            "flavor": "Ledyba secretes an aromatic fluid from where its legs join its\nbody. This fluid is used for communicating with others.\nThis Pokémon conveys its feelings to others by altering the\nfluid’s scent.",
            "name_en": "ledyba",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "166": {
            "flavor": "It is said that in lands with clean air, where the stars fill the\nsky, there live Ledian in countless numbers. There is a good\nreason for this—the Pokémon uses the light of the stars as\nits energy.",
            "name_en": "ledian",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "167": {
            "flavor": "The web spun by Spinarak can be considered its second\nnervous system. It is said that this Pokémon can determine\nwhat kind of prey is touching its web just by the tiny vibrations\nit feels through the web’s strands.",
            "name_en": "spinarak",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "168": {
            "flavor": "Ariados’s feet are tipped with tiny hooked claws that enable it\nto scuttle on ceilings and vertical walls. This Pokémon\nconstricts the foe with thin and strong silk webbing.",
            "name_en": "ariados",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "169": {
            "flavor": "Crobat sneaks up on its intended prey using wings that barely\nmake a sound. This Pokémon rests by hanging on a tree\nbranch with its rear legs that serve as wings.",
            "name_en": "crobat",
            "types": [
                "Poison",
                "Flying"
            ]
        },
        "170": {
            "flavor": "Chinchou’s two antennas are filled with cells that generate\nstrong electricity. This Pokémon’s cells create so much\nelectrical power, it even makes itself tingle slightly.",
            "name_en": "chinchou",
            "types": [
                "Water",
                "Electric"
            ]
        },
        "171": {
            "flavor": "Lanturn is known to emit light. If you peer down into the dark\nsea from a ship at night, you can sometimes see this\nPokémon’s light rising from the depths where it swims. It gives\nthe sea an appearance of a starlit night.",
            "name_en": "lanturn",
            "types": [
                "Water",
                "Electric"
            ]
        },
        "172": {
            "flavor": "When Pichu plays with others, it may short out electricity with\nanother Pichu, creating a shower of sparks. In that event, this\nPokémon will begin crying, startled by the flash of sparks.",
            "name_en": "pichu",
            "types": [
                "Electric"
            ]
        },
        "173": {
            "flavor": "On nights with many shooting stars, Cleffa can be seen\ndancing in a ring. They dance through the night and stop only\nat the break of day, when these Pokémon quench their thirst\nwith the morning dew.",
            "name_en": "cleffa",
            "types": [
                "Fairy"
            ]
        },
        "174": {
            "flavor": "Igglybuff has a soft and plushy body that feels very much like\na marshmallow. From this body wafts a gently sweet fragrance\nthat soothes and calms the emotions of its foes.",
            "name_en": "igglybuff",
            "types": [
                "Normal",
                "Fairy"
            ]
        },
        "175": {
            "flavor": "As its energy, Togepi uses the positive emotions of\ncompassion and pleasure exuded by people and Pokémon.\nThis Pokémon stores up feelings of happiness inside its shell,\nthen shares them with others.",
            "name_en": "togepi",
            "types": [
                "Fairy"
            ]
        },
        "176": {
            "flavor": "Togetic is said to be a Pokémon that brings good fortune.\nWhen the Pokémon spots someone who is pure of heart,\nit is said to appear and share its happiness with that person.",
            "name_en": "togetic",
            "types": [
                "Fairy",
                "Flying"
            ]
        },
        "177": {
            "flavor": "Natu has a highly developed jumping ability. The Pokémon\nflaps and leaps onto tree branches that are taller than\ngrown-up people to pick at the tree’s new shoots.",
            "name_en": "natu",
            "types": [
                "Psychic",
                "Flying"
            ]
        },
        "178": {
            "flavor": "Xatu is known to stand motionless while staring at the sun all\nday long. Some people revere it as a mystical Pokémon out of\ntheir belief that Xatu is in possession of the power to see into\nthe future.",
            "name_en": "xatu",
            "types": [
                "Psychic",
                "Flying"
            ]
        },
        "179": {
            "flavor": "Mareep’s fluffy coat of wool rubs together and builds a static\ncharge. The more static electricity is charged, the more brightly\nthe lightbulb at the tip of its tail glows.",
            "name_en": "mareep",
            "types": [
                "Electric"
            ]
        },
        "180": {
            "flavor": "Flaaffy’s wool quality changes so that it can generate\na high amount of static electricity with a small amount of\nwool. The bare and slick parts of its hide are shielded\nagainst electricity.",
            "name_en": "flaaffy",
            "types": [
                "Electric"
            ]
        },
        "181": {
            "flavor": "Ampharos gives off so much light that it can be seen even from\nspace. People in the old days used the light of this Pokémon\nto send signals back and forth with others far away.",
            "name_en": "ampharos",
            "types": [
                "Electric"
            ]
        },
        "182": {
            "flavor": "A Bellossom grows flowers more beautifully if it has evolved\nfrom a smelly Gloom—the more stinky the better. At night, this\nPokémon closes its petals and goes to sleep.",
            "name_en": "bellossom",
            "types": [
                "Grass"
            ]
        },
        "183": {
            "flavor": "When fishing for food at the edge of a fast-running stream,\nMarill wraps its tail around the trunk of a tree. This Pokémon’s\ntail is flexible and configured to stretch.",
            "name_en": "marill",
            "types": [
                "Water",
                "Fairy"
            ]
        },
        "184": {
            "flavor": "Azumarill can make balloons out of air. It makes these air\nballoons if it spots a drowning Pokémon. The air balloons\nenable the Pokémon in trouble to breathe.",
            "name_en": "azumarill",
            "types": [
                "Water",
                "Fairy"
            ]
        },
        "185": {
            "flavor": "Sudowoodo camouflages itself as a tree to avoid being\nattacked by enemies. However, because its hands remain\ngreen throughout the year, the Pokémon is easily identified\nas a fake during the winter.",
            "name_en": "sudowoodo",
            "types": [
                "Rock"
            ]
        },
        "186": {
            "flavor": "The curled hair on Politoed’s head is proof of its status as a\nking. It is said that the longer and more curled the hair, the\nmore respect this Pokémon earns from its peers.",
            "name_en": "politoed",
            "types": [
                "Water"
            ]
        },
        "187": {
            "flavor": "This Pokémon drifts and floats with the wind. If it senses the\napproach of strong winds, Hoppip links its leaves with other\nHoppip to prepare against being blown away.",
            "name_en": "hoppip",
            "types": [
                "Grass",
                "Flying"
            ]
        },
        "188": {
            "flavor": "Skiploom’s flower blossoms when the temperature rises\nabove 64 degrees Fahrenheit. How much the flower opens\ndepends on the temperature. For that reason, this Pokémon\nis sometimes used as a thermometer.",
            "name_en": "skiploom",
            "types": [
                "Grass",
                "Flying"
            ]
        },
        "189": {
            "flavor": "Jumpluff rides warm southern winds to cross the sea and fly to\nforeign lands. The Pokémon descends to the ground when it\nencounters cold air while it is floating.",
            "name_en": "jumpluff",
            "types": [
                "Grass",
                "Flying"
            ]
        },
        "190": {
            "flavor": "Aipom’s tail ends in a hand-like appendage that can be cleverly\nmanipulated. However, because the Pokémon uses its tail so\nmuch, its real hands have become rather clumsy.",
            "name_en": "aipom",
            "types": [
                "Normal"
            ]
        },
        "191": {
            "flavor": "Sunkern tries to move as little as it possibly can. It does so\nbecause it tries to conserve all the nutrients it has stored in its\nbody for its evolution. It will not eat a thing, subsisting only on\nmorning dew.",
            "name_en": "sunkern",
            "types": [
                "Grass"
            ]
        },
        "192": {
            "flavor": "Sunflora converts solar energy into nutrition. It moves around\nactively in the daytime when it is warm. It stops moving as\nsoon as the sun goes down for the night.",
            "name_en": "sunflora",
            "types": [
                "Grass"
            ]
        },
        "193": {
            "flavor": "Yanma is capable of seeing 360 degrees without having to\nmove its eyes. It is a great flier that is adept at making sudden\nstops and turning midair. This Pokémon uses its flying ability\nto quickly chase down targeted prey.",
            "name_en": "yanma",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "194": {
            "flavor": "Wooper usually lives in water. However, it occasionally comes\nout onto land in search of food. On land, it coats its body with\na gooey, toxic film.",
            "name_en": "wooper",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "195": {
            "flavor": "Quagsire hunts for food by leaving its mouth wide open in\nwater and waiting for its prey to blunder in unaware. Because\nthe Pokémon does not move, it does not get very hungry.",
            "name_en": "quagsire",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "196": {
            "flavor": "Espeon is extremely loyal to any Trainer it considers to\nbe worthy. It is said that this Pokémon developed its\nprecognitive powers to protect its Trainer from harm.",
            "name_en": "espeon",
            "types": [
                "Psychic"
            ]
        },
        "197": {
            "flavor": "Umbreon evolved as a result of exposure to the moon’s waves.\nIt hides silently in darkness and waits for its foes to make a\nmove. The rings on its body glow when it leaps to attack.",
            "name_en": "umbreon",
            "types": [
                "Dark"
            ]
        },
        "198": {
            "flavor": "Murkrow was feared and loathed as the alleged bearer of ill\nfortune. This Pokémon shows strong interest in anything that\nsparkles or glitters. It will even try to steal rings from women.",
            "name_en": "murkrow",
            "types": [
                "Dark",
                "Flying"
            ]
        },
        "199": {
            "flavor": "Slowking undertakes research every day in an effort to solve\nthe mysteries of the world. However, this Pokémon apparently\nforgets everything it has learned if the Shellder on its head\ncomes off.",
            "name_en": "slowking",
            "types": [
                "Water",
                "Psychic"
            ]
        },
        "200": {
            "flavor": "Misdreavus frightens people with a creepy, sobbing cry.\nThe Pokémon apparently uses its red spheres to absorb the\nfearful feelings of foes and turn them into nutrition.",
            "name_en": "misdreavus",
            "types": [
                "Ghost"
            ]
        },
        "201": {
            "flavor": "This Pokémon is shaped like ancient writing. It is a mystery as\nto which came first, the ancient writings or the various Unown.\nResearch into this topic is ongoing but nothing is known.",
            "name_en": "unown",
            "types": [
                "Psychic"
            ]
        },
        "202": {
            "flavor": "Wobbuffet does nothing but endure attacks—it won’t attack on\nits own. However, it won’t endure an attack on its tail. When\nthat happens, the Pokémon will try to take the foe with it using\nDestiny Bond.",
            "name_en": "wobbuffet",
            "types": [
                "Psychic"
            ]
        },
        "203": {
            "flavor": "Girafarig’s rear head contains a tiny brain that is too small for\nthinking. However, the rear head doesn’t need to sleep, so it\ncan keep watch over its surroundings 24 hours a day.",
            "name_en": "girafarig",
            "types": [
                "Normal",
                "Psychic"
            ]
        },
        "204": {
            "flavor": "Pineco hangs from a tree branch and patiently waits for prey to\ncome along. If the Pokémon is disturbed while eating by\nsomeone shaking its tree, it drops down to the ground and\nexplodes with no warning.",
            "name_en": "pineco",
            "types": [
                "Bug"
            ]
        },
        "205": {
            "flavor": "Forretress conceals itself inside its hardened steel shell.\nThe shell is opened when the Pokémon is catching prey,\nbut it does so at such a quick pace that the shell’s inside\ncannot be seen.",
            "name_en": "forretress",
            "types": [
                "Bug",
                "Steel"
            ]
        },
        "206": {
            "flavor": "Dunsparce has a drill for its tail. It uses this tail to burrow into\nthe ground backward. This Pokémon is known to make its\nnest in complex shapes deep under the ground.",
            "name_en": "dunsparce",
            "types": [
                "Normal"
            ]
        },
        "207": {
            "flavor": "Gligar glides through the air without a sound as if it were\nsliding. This Pokémon hangs on to the face of its foe using\nits clawed hind legs and the large pincers on its forelegs, then\ninjects the prey with its poison barb.",
            "name_en": "gligar",
            "types": [
                "Ground",
                "Flying"
            ]
        },
        "208": {
            "flavor": "Steelix lives even further underground than Onix.\nThis Pokémon is known to dig toward the earth’s core.\nThere are records of this Pokémon reaching a depth of\nover six-tenths of a mile underground.",
            "name_en": "steelix",
            "types": [
                "Steel",
                "Ground"
            ]
        },
        "209": {
            "flavor": "By baring its fangs and making a scary face, Snubbull sends\nsmaller Pokémon scurrying away in terror. However, this\nPokémon seems a little sad at making its foes flee.",
            "name_en": "snubbull",
            "types": [
                "Fairy"
            ]
        },
        "210": {
            "flavor": "Granbull has a particularly well-developed lower jaw.\nThe enormous fangs are heavy, causing the Pokémon to tip\nits head back for balance. Unless it is startled, it will not try to\nbite indiscriminately.",
            "name_en": "granbull",
            "types": [
                "Fairy"
            ]
        },
        "211": {
            "flavor": "Qwilfish sucks in water, inflating itself. This Pokémon\nuses the pressure of the water it swallowed to shoot toxic\nquills all at once from all over its body. It finds swimming\nsomewhat challenging.",
            "name_en": "qwilfish",
            "types": [
                "Water",
                "Poison"
            ]
        },
        "212": {
            "flavor": "Scizor has a body with the hardness of steel. It is not easily\nfazed by ordinary sorts of attacks. This Pokémon flaps its\nwings to regulate its body temperature.",
            "name_en": "scizor",
            "types": [
                "Bug",
                "Steel"
            ]
        },
        "213": {
            "flavor": "Shuckle quietly hides itself under rocks, keeping its body\nconcealed inside its hard shell while eating berries it has\nstored away. The berries mix with its body fluids to become\na juice.",
            "name_en": "shuckle",
            "types": [
                "Bug",
                "Rock"
            ]
        },
        "214": {
            "flavor": "Heracross has sharp claws on its feet. These are planted\nfirmly into the ground or the bark of a tree, giving the\nPokémon a secure and solid footing to forcefully fling away\nfoes with its proud horn.",
            "name_en": "heracross",
            "types": [
                "Bug",
                "Fighting"
            ]
        },
        "215": {
            "flavor": "Sneasel scales trees by punching its hooked claws into the\nbark. This Pokémon seeks out unguarded nests and steals\neggs for food while the parents are away.",
            "name_en": "sneasel",
            "types": [
                "Dark",
                "Ice"
            ]
        },
        "216": {
            "flavor": "This Pokémon likes to lick its palms that are sweetened by\nbeing soaked in honey. Teddiursa concocts its own honey\nby blending fruits and pollen collected by Beedrill.",
            "name_en": "teddiursa",
            "types": [
                "Normal"
            ]
        },
        "217": {
            "flavor": "In the forests inhabited by Ursaring, it is said that there are\nmany streams and towering trees where they gather food. This\nPokémon walks through its forest gathering food every day.",
            "name_en": "ursaring",
            "types": [
                "Normal"
            ]
        },
        "218": {
            "flavor": "Slugma does not have any blood in its body. Instead, intensely\nhot magma circulates throughout this Pokémon’s body,\ncarrying essential nutrients and oxygen to its organs.",
            "name_en": "slugma",
            "types": [
                "Fire"
            ]
        },
        "219": {
            "flavor": "Magcargo’s body temperature is approximately\n18,000 degrees Fahrenheit. Water is vaporized on contact.\nIf this Pokémon is caught in the rain, the raindrops instantly\nturn into steam, cloaking the area in a thick fog.",
            "name_en": "magcargo",
            "types": [
                "Fire",
                "Rock"
            ]
        },
        "220": {
            "flavor": "Swinub roots for food by rubbing its snout against the ground.\nIts favorite food is a mushroom that grows under the cover of\ndead grass. This Pokémon occasionally roots out hot springs.",
            "name_en": "swinub",
            "types": [
                "Ice",
                "Ground"
            ]
        },
        "221": {
            "flavor": "Piloswine is covered by a thick coat of long hair that enables\nit to endure the freezing cold. This Pokémon uses its tusks to\ndig up food that has been buried under ice.",
            "name_en": "piloswine",
            "types": [
                "Ice",
                "Ground"
            ]
        },
        "222": {
            "flavor": "Clusters of Corsola congregate in warm seas where they serve\nas ideal hiding places for smaller Pokémon. When the water\ntemperature falls, this Pokémon migrates to the southern seas.",
            "name_en": "corsola",
            "types": [
                "Water",
                "Rock"
            ]
        },
        "223": {
            "flavor": "Remoraid sucks in water, then expels it at high velocity using\nits abdominal muscles to shoot down flying prey. When\nevolution draws near, this Pokémon travels downstream\nfrom rivers.",
            "name_en": "remoraid",
            "types": [
                "Water"
            ]
        },
        "224": {
            "flavor": "Octillery grabs onto its foe using its tentacles. This Pokémon\ntries to immobilize it before delivering the finishing blow. If the\nfoe turns out to be too strong, Octillery spews ink to escape.",
            "name_en": "octillery",
            "types": [
                "Water"
            ]
        },
        "225": {
            "flavor": "Delibird carries its food bundled up in its tail. There once was\na famous explorer who managed to reach the peak of the\nworld’s highest mountain, thanks to one of these Pokémon\nsharing its food.",
            "name_en": "delibird",
            "types": [
                "Ice",
                "Flying"
            ]
        },
        "226": {
            "flavor": "On sunny days, schools of Mantine can be seen elegantly\nleaping over the sea’s waves. This Pokémon is not bothered\nby the Remoraid that hitches rides.",
            "name_en": "mantine",
            "types": [
                "Water",
                "Flying"
            ]
        },
        "227": {
            "flavor": "Skarmory’s steel wings become tattered and bashed in from\nrepeated battles. Once a year, the battered wings grow back\ncompletely, restoring the cutting edges to their pristine state.",
            "name_en": "skarmory",
            "types": [
                "Steel",
                "Flying"
            ]
        },
        "228": {
            "flavor": "Houndour hunt as a coordinated pack. They communicate\nwith each other using a variety of cries to corner their prey.\nThis Pokémon’s remarkable teamwork is unparalleled.",
            "name_en": "houndour",
            "types": [
                "Dark",
                "Fire"
            ]
        },
        "229": {
            "flavor": "In a Houndoom pack, the one with its horns raked sharply\ntoward the back serves a leadership role. These Pokémon\nchoose their leader by fighting among themselves.",
            "name_en": "houndoom",
            "types": [
                "Dark",
                "Fire"
            ]
        },
        "230": {
            "flavor": "Kingdra sleeps on the seafloor where it is otherwise devoid\nof life. When a storm arrives, the Pokémon is said to awaken\nand wander about in search of prey.",
            "name_en": "kingdra",
            "types": [
                "Water",
                "Dragon"
            ]
        },
        "231": {
            "flavor": "Phanpy uses its long nose to shower itself. When others\ngather around, they thoroughly douse each other with water.\nThese Pokémon can be seen drying their soaking-wet\nbodies at the edge of water.",
            "name_en": "phanpy",
            "types": [
                "Ground"
            ]
        },
        "232": {
            "flavor": "If Donphan were to tackle with its hard body, even a house\ncould be destroyed. Using its massive strength, the Pokémon\nhelps clear rock and mud slides that block mountain trails.",
            "name_en": "donphan",
            "types": [
                "Ground"
            ]
        },
        "233": {
            "flavor": "Porygon2 was created by humans using the power of science.\nThe man-made Pokémon has been endowed with artificial\nintelligence that enables it to learn new gestures and emotions\non its own.",
            "name_en": "porygon2",
            "types": [
                "Normal"
            ]
        },
        "234": {
            "flavor": "Stantler’s magnificent antlers were traded at high prices as\nworks of art. As a result, this Pokémon was hunted close to\nextinction by those who were after the priceless antlers.",
            "name_en": "stantler",
            "types": [
                "Normal"
            ]
        },
        "235": {
            "flavor": "Smeargle marks the boundaries of its territory using a body\nfluid that leaks out from the tip of its tail. Over 5,000 different\nmarks left by this Pokémon have been found.",
            "name_en": "smeargle",
            "types": [
                "Normal"
            ]
        },
        "236": {
            "flavor": "Tyrogue becomes stressed out if it does not get to train every\nday. When raising this Pokémon, the Trainer must establish\nand uphold various training methods.",
            "name_en": "tyrogue",
            "types": [
                "Fighting"
            ]
        },
        "237": {
            "flavor": "Hitmontop spins on its head at high speed, all the while\ndelivering kicks. This technique is a remarkable mix of both\noffense and defense at the same time. The Pokémon travels\nfaster spinning than it does walking.",
            "name_en": "hitmontop",
            "types": [
                "Fighting"
            ]
        },
        "238": {
            "flavor": "Smoochum actively runs about, but also falls quite often.\nWhenever the chance arrives, it will look for its reflection to\nmake sure its face hasn’t become dirty.",
            "name_en": "smoochum",
            "types": [
                "Ice",
                "Psychic"
            ]
        },
        "239": {
            "flavor": "Elekid stores electricity in its body. If it touches metal and\naccidentally discharges all its built-up electricity, this Pokémon\nbegins swinging its arms in circles to recharge itself.",
            "name_en": "elekid",
            "types": [
                "Electric"
            ]
        },
        "240": {
            "flavor": "Magby’s state of health is determined by observing the fire it\nbreathes. If the Pokémon is spouting yellow flames from its\nmouth, it is in good health. When it is fatigued, black smoke\nwill be mixed in with the flames.",
            "name_en": "magby",
            "types": [
                "Fire"
            ]
        },
        "241": {
            "flavor": "Miltank gives over five gallons of milk on a daily basis. Its\nsweet milk is enjoyed by children and grown-ups alike. People\nwho can’t drink milk turn it into yogurt and eat it instead.",
            "name_en": "miltank",
            "types": [
                "Normal"
            ]
        },
        "242": {
            "flavor": "Blissey senses sadness with its fluffy coat of fur. If it does so,\nthis Pokémon will rush over to a sad person, no matter how far\naway, to share a Lucky Egg that brings a smile to any face.",
            "name_en": "blissey",
            "types": [
                "Normal"
            ]
        },
        "243": {
            "flavor": "Raikou embodies the speed of lightning. The roars of\nthis Pokémon send shock waves shuddering through the\nair and shake the ground as if lightning bolts had come\ncrashing down.",
            "name_en": "raikou",
            "types": [
                "Electric"
            ]
        },
        "244": {
            "flavor": "Entei embodies the passion of magma. This Pokémon is\nthought to have been born in the eruption of a volcano.\nIt sends up massive bursts of fire that utterly consume all\nthat they touch.",
            "name_en": "entei",
            "types": [
                "Fire"
            ]
        },
        "245": {
            "flavor": "Suicune embodies the compassion of a pure spring of water.\nIt runs across the land with gracefulness. This Pokémon has\nthe power to purify dirty water.",
            "name_en": "suicune",
            "types": [
                "Water"
            ]
        },
        "246": {
            "flavor": "Larvitar is born deep under the ground. To come up to the\nsurface, this Pokémon must eat its way through the soil above.\nUntil it does so, Larvitar cannot see its parents.",
            "name_en": "larvitar",
            "types": [
                "Rock",
                "Ground"
            ]
        },
        "247": {
            "flavor": "Pupitar creates a gas inside its body that it compresses and\nforcefully ejects to propel itself like a jet. The body is very\ndurable—it avoids damage even if it hits solid steel.",
            "name_en": "pupitar",
            "types": [
                "Rock",
                "Ground"
            ]
        },
        "248": {
            "flavor": "Tyranitar is so overwhelmingly powerful, it can bring down a\nwhole mountain to make its nest. This Pokémon wanders about\nin mountains seeking new opponents to fight.",
            "name_en": "tyranitar",
            "types": [
                "Rock",
                "Dark"
            ]
        },
        "249": {
            "flavor": "Lugia’s wings pack devastating power—a light fluttering of its\nwings can blow apart regular houses. As a result, this\nPokémon chooses to live out of sight deep under the sea.",
            "name_en": "lugia",
            "types": [
                "Psychic",
                "Flying"
            ]
        },
        "250": {
            "flavor": "Ho-Oh’s feathers glow in seven colors depending on the angle\nat which they are struck by light. These feathers are said to\nbring happiness to the bearers. This Pokémon is said to live at\nthe foot of a rainbow.",
            "name_en": "ho-oh",
            "types": [
                "Fire",
                "Flying"
            ]
        },
        "251": {
            "flavor": "This Pokémon came from the future by crossing over time.\nIt is thought that so long as Celebi appears, a bright and\nshining future awaits us.",
            "name_en": "celebi",
            "types": [
                "Psychic",
                "Grass"
            ]
        },
        "252": {
            "flavor": "Treecko is cool, calm, and collected—it never panics under\nany situation. If a bigger foe were to glare at this Pokémon,\nit would glare right back without conceding an inch of ground.",
            "name_en": "treecko",
            "types": [
                "Grass"
            ]
        },
        "253": {
            "flavor": "This Pokémon adeptly flies from branch to branch in trees.\nIn a forest, no Pokémon can ever hope to catch a fleeing\nGrovyle however fast they may be.",
            "name_en": "grovyle",
            "types": [
                "Grass"
            ]
        },
        "254": {
            "flavor": "Sceptile has seeds growing on its back. They are said to be\nbursting with nutrients that revitalize trees. This Pokémon\nraises the trees in a forest with loving care.",
            "name_en": "sceptile",
            "types": [
                "Grass"
            ]
        },
        "255": {
            "flavor": "Torchic has a place inside its body where it keeps its flame.\nGive it a hug—it will be glowing with warmth. This Pokémon is\ncovered all over by a fluffy coat of down.",
            "name_en": "torchic",
            "types": [
                "Fire"
            ]
        },
        "256": {
            "flavor": "Combusken battles with the intensely hot flames it spews from\nits beak and with outstandingly destructive kicks. This\nPokémon’s cry is very loud and distracting.",
            "name_en": "combusken",
            "types": [
                "Fire",
                "Fighting"
            ]
        },
        "257": {
            "flavor": "Blaziken has incredibly strong legs—it can easily clear a\n30-story building in one leap. This Pokémon’s blazing punches\nleave its foes scorched and blackened.",
            "name_en": "blaziken",
            "types": [
                "Fire",
                "Fighting"
            ]
        },
        "258": {
            "flavor": "In water, Mudkip breathes using the gills on its cheeks. If it is\nfaced with a tight situation in battle, this Pokémon will unleash\nits amazing power—it can crush rocks bigger than itself.",
            "name_en": "mudkip",
            "types": [
                "Water"
            ]
        },
        "259": {
            "flavor": "Marshtomp is much faster at traveling through mud than it is at\nswimming. This Pokémon’s hindquarters exhibit obvious\ndevelopment, giving it the ability to walk on just its hind legs.",
            "name_en": "marshtomp",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "260": {
            "flavor": "Swampert predicts storms by sensing subtle differences in the\nsounds of waves and tidal winds with its fins. If a storm is\napproaching, it piles up boulders to protect itself.",
            "name_en": "swampert",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "261": {
            "flavor": "Poochyena is an omnivore—it will eat anything. A distinguishing\nfeature is how large its fangs are compared to its body. This\nPokémon tries to intimidate its foes by making the hair on its\ntail bristle out.",
            "name_en": "poochyena",
            "types": [
                "Dark"
            ]
        },
        "262": {
            "flavor": "Mightyena travel and act as a pack in the wild. The memory\nof its life in the wild compels the Pokémon to obey only\nthose Trainers that it recognizes to possess superior skill.",
            "name_en": "mightyena",
            "types": [
                "Dark"
            ]
        },
        "263": {
            "flavor": "The hair on Zigzagoon’s back is bristly. It rubs the hard back\nhair against trees to leave its territorial markings. This Pokémon\nmay play dead to fool foes in battle.",
            "name_en": "zigzagoon",
            "types": [
                "Normal"
            ]
        },
        "264": {
            "flavor": "When hunting, Linoone will make a beeline straight for the\nprey at a full run. While this Pokémon is capable of topping\n60 mph, it has to come to a screeching halt before it can turn.",
            "name_en": "linoone",
            "types": [
                "Normal"
            ]
        },
        "265": {
            "flavor": "Wurmple is targeted by Swellow as prey. This Pokémon\nwill try to resist by pointing the spikes on its rear at the\nattacking predator. It will weaken the foe by leaking poison\nfrom the spikes.",
            "name_en": "wurmple",
            "types": [
                "Bug"
            ]
        },
        "266": {
            "flavor": "Silcoon was thought to endure hunger and not consume\nanything before its evolution. However, it is now thought\nthat this Pokémon slakes its thirst by drinking rainwater\nthat collects on its silk.",
            "name_en": "silcoon",
            "types": [
                "Bug"
            ]
        },
        "267": {
            "flavor": "Beautifly has a long mouth like a coiled needle, which is very\nconvenient for collecting pollen from flowers. This Pokémon\nrides the spring winds as it flits around gathering pollen.",
            "name_en": "beautifly",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "268": {
            "flavor": "If it is attacked, Cascoon remains motionless however badly it\nmay be hurt. It does so because if it were to move, its body\nwould be weak upon evolution. This Pokémon will also not\nforget the pain it endured.",
            "name_en": "cascoon",
            "types": [
                "Bug"
            ]
        },
        "269": {
            "flavor": "When Dustox flaps its wings, a fine dust is scattered all over.\nThis dust is actually a powerful poison that will even make a\npro wrestler sick. This Pokémon searches for food using its\nantennae like radar.",
            "name_en": "dustox",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "270": {
            "flavor": "Lotad is said to have dwelled on land before. However, this\nPokémon is thought to have returned to water because the\nleaf on its head grew large and heavy. It now lives by floating\natop the water.",
            "name_en": "lotad",
            "types": [
                "Water",
                "Grass"
            ]
        },
        "271": {
            "flavor": "Lombre’s entire body is covered by a slippery, slimy film.\nIt feels horribly unpleasant to be touched by this Pokémon’s\nhands. Lombre is often mistaken for a human child.",
            "name_en": "lombre",
            "types": [
                "Water",
                "Grass"
            ]
        },
        "272": {
            "flavor": "Upon hearing an upbeat and cheerful rhythm, the cells in\nLudicolo’s body become very energetic and active. Even\nin battle, this Pokémon will exhibit an amazing amount\nof power.",
            "name_en": "ludicolo",
            "types": [
                "Water",
                "Grass"
            ]
        },
        "273": {
            "flavor": "Seedot looks exactly like an acorn when it is dangling from a\ntree branch. It startles other Pokémon by suddenly moving.\nThis Pokémon polishes its body once a day using leaves.",
            "name_en": "seedot",
            "types": [
                "Grass"
            ]
        },
        "274": {
            "flavor": "This Pokémon pulls out the leaf on its head and makes a flute\nwith it. The sound of Nuzleaf’s flute strikes fear and uncertainty\nin the hearts of people lost in a forest.",
            "name_en": "nuzleaf",
            "types": [
                "Grass",
                "Dark"
            ]
        },
        "275": {
            "flavor": "Shiftry’s large fans generate awesome gusts of wind at a\nspeed close to 100 feet per second. The whipped-up wind\nblows anything away. This Pokémon chooses to live quietly\ndeep in forests.",
            "name_en": "shiftry",
            "types": [
                "Grass",
                "Dark"
            ]
        },
        "276": {
            "flavor": "Taillow is young—it has only just left its nest. As a result,\nit sometimes becomes lonesome and cries at night.\nThis Pokémon feeds on Wurmple that live in forests.",
            "name_en": "taillow",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "277": {
            "flavor": "Swellow is very conscientious about the upkeep of its glossy\nwings. Once two Swellow are gathered, they diligently take\ncare of cleaning each other’s wings.",
            "name_en": "swellow",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "278": {
            "flavor": "Wingull rides updrafts rising from the sea by extending its long\nand narrow wings to glide. This Pokémon’s long beak is useful\nfor catching prey.",
            "name_en": "wingull",
            "types": [
                "Water",
                "Flying"
            ]
        },
        "279": {
            "flavor": "Pelipper searches for food while in flight by skimming the wave\ntops. This Pokémon dips its large bill in the sea to scoop up\nfood, then swallows everything in one big gulp.",
            "name_en": "pelipper",
            "types": [
                "Water",
                "Flying"
            ]
        },
        "280": {
            "flavor": "Ralts has the ability to sense the emotions of people. If its\nTrainer is in a cheerful mood, this Pokémon grows cheerful\nand joyous in the same way.",
            "name_en": "ralts",
            "types": [
                "Psychic",
                "Fairy"
            ]
        },
        "281": {
            "flavor": "Kirlia uses the horns on its head to amplify its psychokinetic\npower. When the Pokémon uses its power, the air around it\nbecomes distorted, creating mirages of nonexistent scenery.",
            "name_en": "kirlia",
            "types": [
                "Psychic",
                "Fairy"
            ]
        },
        "282": {
            "flavor": "Gardevoir has the psychokinetic power to distort the\ndimensions and create a small black hole. This Pokémon\nwill try to protect its Trainer even at the risk of its own life.",
            "name_en": "gardevoir",
            "types": [
                "Psychic",
                "Fairy"
            ]
        },
        "283": {
            "flavor": "If Surskit senses danger, it secretes a thick, sugary syrup from\nthe tip of its head. There are some Pokémon that love eating\nthis syrup.",
            "name_en": "surskit",
            "types": [
                "Bug",
                "Water"
            ]
        },
        "284": {
            "flavor": "Masquerain’s antennas have eyelike patterns that usually\ngive it an angry look. If the “eyes” are droopy and appear sad,\nit is said to be a sign that a heavy rainfall is on its way.",
            "name_en": "masquerain",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "285": {
            "flavor": "If Shroomish senses danger, it shakes its body and scatters\nspores from the top of its head. This Pokémon’s spores are\nso toxic, they make trees and weeds wilt.",
            "name_en": "shroomish",
            "types": [
                "Grass"
            ]
        },
        "286": {
            "flavor": "The seeds ringing Breloom’s tail are made of hardened toxic\nspores. It is horrible to eat the seeds. Just taking a bite of this\nPokémon’s seed will cause your stomach to rumble.",
            "name_en": "breloom",
            "types": [
                "Grass",
                "Fighting"
            ]
        },
        "287": {
            "flavor": "Slakoth’s heart beats just once a minute. Whatever happens,\nit is content to loaf around motionless. It is rare to see this\nPokémon in motion.",
            "name_en": "slakoth",
            "types": [
                "Normal"
            ]
        },
        "288": {
            "flavor": "Vigoroth is simply incapable of remaining still. Even when it\ntries to sleep, the blood in its veins grows agitated, compelling\nthis Pokémon to run wild throughout the jungle before it can\nsettle down.",
            "name_en": "vigoroth",
            "types": [
                "Normal"
            ]
        },
        "289": {
            "flavor": "Wherever Slaking live, rings of over a yard in diameter appear\nin grassy fields. They are made by the Pokémon as it eats all\nthe grass within reach while lying prone on the ground.",
            "name_en": "slaking",
            "types": [
                "Normal"
            ]
        },
        "290": {
            "flavor": "Nincada lives underground. It uses its sharp claws to carve the\nroots of trees and absorb moisture and nutrients.\nThis Pokémon can’t withstand bright sunlight so avoids it.",
            "name_en": "nincada",
            "types": [
                "Bug",
                "Ground"
            ]
        },
        "291": {
            "flavor": "If Ninjask is not trained properly, it will refuse to obey\nthe Trainer and cry loudly continuously. Because of this\nquality, this Pokémon is said to be one that puts the\nTrainer’s abilities to the test.",
            "name_en": "ninjask",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "292": {
            "flavor": "Shedinja is a peculiar Pokémon. It seems to appear unsought\nin a Poké Ball after a Nincada evolves. This bizarre Pokémon\nis entirely immobile—it doesn’t even breathe.",
            "name_en": "shedinja",
            "types": [
                "Bug",
                "Ghost"
            ]
        },
        "293": {
            "flavor": "Whismur is very timid. If it starts to cry loudly, it becomes\nstartled by its own crying and cries even harder. When it finally\nstops crying, the Pokémon goes to sleep, all tired out.",
            "name_en": "whismur",
            "types": [
                "Normal"
            ]
        },
        "294": {
            "flavor": "Loudred shouts while stamping its feet. After it finishes\nshouting, this Pokémon becomes incapable of hearing\nanything for a while. This is considered to be a weak point.",
            "name_en": "loudred",
            "types": [
                "Normal"
            ]
        },
        "295": {
            "flavor": "Exploud communicates its feelings to the others by emitting\nwhistle-like sounds from the tubes on its body. This Pokémon\nonly raises its voice when it is in battle.",
            "name_en": "exploud",
            "types": [
                "Normal"
            ]
        },
        "296": {
            "flavor": "Makuhita has a tireless spirit—it will never give up hope.\nIt eats a lot of food, gets plenty of sleep, and it trains very\nrigorously. By living that way, this Pokémon packs its body\nwith energy.",
            "name_en": "makuhita",
            "types": [
                "Fighting"
            ]
        },
        "297": {
            "flavor": "Hariyama’s thick body may appear fat, but it is actually a hunk\nof solid muscle. If this Pokémon bears down and tightens all its\nmuscles, its body becomes as hard as a rock.",
            "name_en": "hariyama",
            "types": [
                "Fighting"
            ]
        },
        "298": {
            "flavor": "Azurill’s tail is large and bouncy. It is packed full of the\nnutrients this Pokémon needs to grow. Azurill can be seen\nbouncing and playing on its big, rubbery tail.",
            "name_en": "azurill",
            "types": [
                "Normal",
                "Fairy"
            ]
        },
        "299": {
            "flavor": "Nosepass had been said to be completely unmoving, with its\nmagnetic nose pointed due north. However, close observation\nhas revealed that the Pokémon actually moves by a little over\n3/8 of an inch every year.",
            "name_en": "nosepass",
            "types": [
                "Rock"
            ]
        },
        "300": {
            "flavor": "Skitty is known to chase around playfully after its own tail.\nIn the wild, this Pokémon lives in holes in the trees of forests.\nIt is very popular as a pet because of its adorable looks.",
            "name_en": "skitty",
            "types": [
                "Normal"
            ]
        },
        "301": {
            "flavor": "Delcatty sleeps anywhere it wants without keeping a permanent\nnest. If other Pokémon approach it as it sleeps, this Pokémon\nwill never fight—it will just move away somewhere else.",
            "name_en": "delcatty",
            "types": [
                "Normal"
            ]
        },
        "302": {
            "flavor": "Sableye digs the ground with sharpened claws to find rocks\nthat it eats. Substances in the eaten rocks crystallize and rise\nup to the Pokémon’s body surface.",
            "name_en": "sableye",
            "types": [
                "Dark",
                "Ghost"
            ]
        },
        "303": {
            "flavor": "Don’t be taken in by this Pokémon’s cute face—it’s very\ndangerous. Mawile fools the foe into letting down its guard,\nthen chomps down with its massive jaws. The steel jaws are\nreally horns that have been transformed.",
            "name_en": "mawile",
            "types": [
                "Steel",
                "Fairy"
            ]
        },
        "304": {
            "flavor": "Aron has a body of steel. With one all-out charge, this\nPokémon can demolish even a heavy dump truck.\nThe destroyed dump truck then becomes a handy meal\nfor the Pokémon.",
            "name_en": "aron",
            "types": [
                "Steel",
                "Rock"
            ]
        },
        "305": {
            "flavor": "Lairon feeds on iron contained in rocks and water. It makes\nits nest on mountains where iron ore is buried. As a result,\nthe Pokémon often clashes with humans mining the iron ore.",
            "name_en": "lairon",
            "types": [
                "Steel",
                "Rock"
            ]
        },
        "306": {
            "flavor": "Aggron is protective of its environment. If its mountain is\nravaged by a landslide or a fire, this Pokémon will haul\ntopsoil to the area, plant trees, and beautifully restore its\nown territory.",
            "name_en": "aggron",
            "types": [
                "Steel",
                "Rock"
            ]
        },
        "307": {
            "flavor": "Meditite heightens its inner energy through meditation.\nIt survives on just one berry a day. Minimal eating is another\naspect of this Pokémon’s training.",
            "name_en": "meditite",
            "types": [
                "Fighting",
                "Psychic"
            ]
        },
        "308": {
            "flavor": "Through the power of meditation, Medicham developed its\nsixth sense. It gained the ability to use psychokinetic powers.\nThis Pokémon is known to meditate for a whole month\nwithout eating.",
            "name_en": "medicham",
            "types": [
                "Fighting",
                "Psychic"
            ]
        },
        "309": {
            "flavor": "Electrike runs faster than the human eye can follow.\nThe friction from running is converted into electricity,\nwhich is then stored in this Pokémon’s fur.",
            "name_en": "electrike",
            "types": [
                "Electric"
            ]
        },
        "310": {
            "flavor": "Manectric discharges strong electricity from its mane.\nThe mane is used for collecting electricity in the atmosphere.\nThis Pokémon creates thunderclouds above its head.",
            "name_en": "manectric",
            "types": [
                "Electric"
            ]
        },
        "311": {
            "flavor": "When Plusle is cheering on its partner, it flashes with electric\nsparks from all over its body. If its partner loses, this Pokémon\ncries loudly.",
            "name_en": "plusle",
            "types": [
                "Electric"
            ]
        },
        "312": {
            "flavor": "Minun loves to cheer on its partner in battle. It gives off sparks\nfrom its body while it is doing so. If its partner is in trouble,\nthis Pokémon gives off increasing amounts of sparks.",
            "name_en": "minun",
            "types": [
                "Electric"
            ]
        },
        "313": {
            "flavor": "Volbeat’s tail glows like a lightbulb. With other Volbeat,\nit uses its tail to draw geometric shapes in the night sky.\nThis Pokémon loves the sweet aroma given off by Illumise.",
            "name_en": "volbeat",
            "types": [
                "Bug"
            ]
        },
        "314": {
            "flavor": "Illumise leads a flight of illuminated Volbeat to draw signs in\nthe night sky. This Pokémon is said to earn greater respect\nfrom its peers by composing more complex designs in the sky.",
            "name_en": "illumise",
            "types": [
                "Bug"
            ]
        },
        "315": {
            "flavor": "On extremely rare occasions, a Roselia is said to appear with\nits flowers in unusual colors. The thorns on this Pokémon’s\nhead contain a vicious poison.",
            "name_en": "roselia",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "316": {
            "flavor": "Most of Gulpin’s body is made up of its stomach—its heart and\nbrain are very small in comparison. This Pokémon’s stomach\ncontains special enzymes that dissolve anything.",
            "name_en": "gulpin",
            "types": [
                "Poison"
            ]
        },
        "317": {
            "flavor": "Swalot has no teeth, so what it eats, it swallows whole, no\nmatter what. Its cavernous mouth yawns widely. An automobile\ntire could easily fit inside this Pokémon’s mouth.",
            "name_en": "swalot",
            "types": [
                "Poison"
            ]
        },
        "318": {
            "flavor": "If anything invades Carvanha’s territory, it will swarm and tear\nat the intruder with its pointed fangs. On its own, however, this\nPokémon turns suddenly timid.",
            "name_en": "carvanha",
            "types": [
                "Water",
                "Dark"
            ]
        },
        "319": {
            "flavor": "Sharpedo can swim at speeds of up to 75 mph by jetting\nseawater out of its backside. This Pokémon’s drawback is its\ninability to swim long distances.",
            "name_en": "sharpedo",
            "types": [
                "Water",
                "Dark"
            ]
        },
        "320": {
            "flavor": "Wailmer can store water inside its body to transform itself\ninto a ball for bouncing around on the ground. By filling itself\nup with more water, this Pokémon can elevate the height of\nits bounces.",
            "name_en": "wailmer",
            "types": [
                "Water"
            ]
        },
        "321": {
            "flavor": "When chasing prey, Wailord herds them by leaping out of the\nwater and making a humongous splash. It is breathtaking to\nsee this Pokémon leaping out of the sea with others in its pod.",
            "name_en": "wailord",
            "types": [
                "Water"
            ]
        },
        "322": {
            "flavor": "Numel stores magma of almost 2,200 degrees Fahrenheit\nwithin its body. If it gets wet, the magma cools and hardens.\nIn that event, the Pokémon’s body grows heavy and its\nmovements become sluggish.",
            "name_en": "numel",
            "types": [
                "Fire",
                "Ground"
            ]
        },
        "323": {
            "flavor": "The humps on Camerupt’s back are formed by a transformation\nof its bones. They sometimes blast out molten magma.\nThis Pokémon apparently erupts often when it is enraged.",
            "name_en": "camerupt",
            "types": [
                "Fire",
                "Ground"
            ]
        },
        "324": {
            "flavor": "Torkoal generates energy by burning coal. It grows weaker\nas the fire dies down. When it is preparing for battle, this\nPokémon burns more coal.",
            "name_en": "torkoal",
            "types": [
                "Fire"
            ]
        },
        "325": {
            "flavor": "Spoink keeps a pearl on top of its head. The pearl functions to\namplify this Pokémon’s psychokinetic powers. It is therefore on\na constant search for a bigger pearl.",
            "name_en": "spoink",
            "types": [
                "Psychic"
            ]
        },
        "326": {
            "flavor": "Grumpig uses the black pearls on its body to wield\nits fantastic powers. When it is doing so, it dances bizarrely.\nThis Pokémon’s black pearls are valuable as works of art.",
            "name_en": "grumpig",
            "types": [
                "Psychic"
            ]
        },
        "327": {
            "flavor": "No two Spinda are said to have identical spot patterns on their\nhides. This Pokémon moves in a curious manner as if it is\nstumbling in dizziness. Its lurching movements can cause the\nopponent to become confused.",
            "name_en": "spinda",
            "types": [
                "Normal"
            ]
        },
        "328": {
            "flavor": "Trapinch is a patient hunter. It digs an inescapable pit in a\ndesert and waits for its prey to come tumbling down. This\nPokémon can go a whole week without access to any water.",
            "name_en": "trapinch",
            "types": [
                "Ground"
            ]
        },
        "329": {
            "flavor": "Vibrava’s wings have not yet completed the process of\ngrowing. Rather than flying long distances, they are more\nuseful for generating ultrasonic waves by vibrating.",
            "name_en": "vibrava",
            "types": [
                "Ground",
                "Dragon"
            ]
        },
        "330": {
            "flavor": "Flygon whips up a sandstorm by flapping its wings. The wings\ncreate a series of notes that sound like singing. Because the\n“singing” is the only thing that can be heard in a sandstorm,\nthis Pokémon is said to be the desert spirit.",
            "name_en": "flygon",
            "types": [
                "Ground",
                "Dragon"
            ]
        },
        "331": {
            "flavor": "The more arid and harsh the environment, the more pretty and\nfragrant a flower Cacnea grows. This Pokémon battles by\nwildly swinging its thorny arms.",
            "name_en": "cacnea",
            "types": [
                "Grass"
            ]
        },
        "332": {
            "flavor": "If a traveler is going through a desert in the thick of night,\nCacturne will follow in a ragtag group. The Pokémon are\nbiding their time, waiting for the traveler to tire and become\nincapable of moving.",
            "name_en": "cacturne",
            "types": [
                "Grass",
                "Dark"
            ]
        },
        "333": {
            "flavor": "Swablu loves to make things clean. If it spots something dirty,\nit will wipe and polish it with its cottony wings. If its wings\nbecome dirty, this Pokémon finds a stream and showers itself.",
            "name_en": "swablu",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "334": {
            "flavor": "Altaria sings in a gorgeous soprano. Its wings are like cotton\nclouds. This Pokémon catches updrafts with its buoyant wings\nand soars way up into the wild blue yonder.",
            "name_en": "altaria",
            "types": [
                "Dragon",
                "Flying"
            ]
        },
        "335": {
            "flavor": "Zangoose usually stays on all fours, but when angered, it gets\nup on its hind legs and extends its claws. This Pokémon shares\na bitter rivalry with Seviper that dates back over generations.",
            "name_en": "zangoose",
            "types": [
                "Normal"
            ]
        },
        "336": {
            "flavor": "Seviper’s swordlike tail serves two purposes—it slashes foes\nand douses them with secreted poison. This Pokémon will not\ngive up its long-running blood feud with Zangoose.",
            "name_en": "seviper",
            "types": [
                "Poison"
            ]
        },
        "337": {
            "flavor": "Lunatone becomes active around the time of the full moon.\nInstead of walking, it moves by floating in midair.\nThe Pokémon’s intimidating red eyes cause all those who\nsee it to become transfixed with fear.",
            "name_en": "lunatone",
            "types": [
                "Rock",
                "Psychic"
            ]
        },
        "338": {
            "flavor": "Sunlight is the source of Solrock’s power. It is said to possess\nthe ability to read the emotions of others. This Pokémon gives\noff intense heat while rotating its body.",
            "name_en": "solrock",
            "types": [
                "Rock",
                "Psychic"
            ]
        },
        "339": {
            "flavor": "Barboach’s body is covered with a slimy film. If a foe grabs it,\nthis Pokémon just slips out of the enemy’s grip. This Pokémon\ngrows weak if the slimy coating dries up.",
            "name_en": "barboach",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "340": {
            "flavor": "If Whiscash goes on a wild rampage, it sets off a quake-like\ntremor with a radius of over three miles. This Pokémon has\nthe ability to predict real earthquakes.",
            "name_en": "whiscash",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "341": {
            "flavor": "Corphish catches prey with its sharp claws. It has no\nlikes or dislikes when it comes to food—it will eat anything.\nThis Pokémon has no trouble living in filthy water.",
            "name_en": "corphish",
            "types": [
                "Water"
            ]
        },
        "342": {
            "flavor": "Crawdaunt molts (sheds) its shell regularly. Immediately after\nmolting, its shell is soft and tender. Until the shell hardens,\nthis Pokémon hides in its streambed burrow to avoid attack\nfrom its foes.",
            "name_en": "crawdaunt",
            "types": [
                "Water",
                "Dark"
            ]
        },
        "343": {
            "flavor": "As soon as it spots others of its kind, Baltoy congregates with\nthem and then begins crying noisily in unison. This Pokémon\nsleeps while cleverly balancing itself on its one foot.",
            "name_en": "baltoy",
            "types": [
                "Ground",
                "Psychic"
            ]
        },
        "344": {
            "flavor": "Claydol is an enigma that appeared from a clay statue made by\nan ancient civilization dating back 20,000 years. This Pokémon\nshoots beams from both its hands.",
            "name_en": "claydol",
            "types": [
                "Ground",
                "Psychic"
            ]
        },
        "345": {
            "flavor": "Lileep is an ancient Pokémon that was regenerated from a\nfossil. It remains permanently anchored to a rock. From its\nimmobile perch, this Pokémon intently scans for prey with its\ntwo eyes.",
            "name_en": "lileep",
            "types": [
                "Rock",
                "Grass"
            ]
        },
        "346": {
            "flavor": "Cradily’s body serves as an anchor, preventing it from being\nwashed away in rough seas. This Pokémon secretes a strong\ndigestive fluid from its tentacles.",
            "name_en": "cradily",
            "types": [
                "Rock",
                "Grass"
            ]
        },
        "347": {
            "flavor": "Anorith is said to be a type of Pokémon predecessor, with\neight wings at the sides of its body. This Pokémon swam in the\nprimordial sea by undulating these eight wings.",
            "name_en": "anorith",
            "types": [
                "Rock",
                "Bug"
            ]
        },
        "348": {
            "flavor": "Armaldo is a Pokémon species that became extinct in\nprehistoric times. This Pokémon is said to have walked\non its hind legs, which would have been more convenient\nfor life on land.",
            "name_en": "armaldo",
            "types": [
                "Rock",
                "Bug"
            ]
        },
        "349": {
            "flavor": "While Feebas’s body is in tatters, it has a hardy and tenacious\nlife force that enables it to live anywhere. However, this\nPokémon is also slow and dimwitted, making it an easy catch.",
            "name_en": "feebas",
            "types": [
                "Water"
            ]
        },
        "350": {
            "flavor": "Milotic live at the bottom of large lakes. When this\nPokémon’s body glows a vivid pink, it releases a pulsing\nwave of energy that brings soothing calm to troubled hearts.",
            "name_en": "milotic",
            "types": [
                "Water"
            ]
        },
        "351": {
            "flavor": "Castform borrows the power of nature to transform itself\ninto the guises of the sun, rain, and snow-clouds.\nThis Pokémon’s feelings change with the weather.",
            "name_en": "castform",
            "types": [
                "Normal"
            ]
        },
        "352": {
            "flavor": "Kecleon alters its body coloration to blend in with its\nsurroundings, allowing it to sneak up on its prey unnoticed.\nThen it lashes out with its long, stretchy tongue to instantly\nensnare the unsuspecting target.",
            "name_en": "kecleon",
            "types": [
                "Normal"
            ]
        },
        "353": {
            "flavor": "Shuppet grows by feeding on dark emotions, such as\nvengefulness and envy, in the hearts of people. It roams\nthrough cities in search of grudges that taint people.",
            "name_en": "shuppet",
            "types": [
                "Ghost"
            ]
        },
        "354": {
            "flavor": "A cursed energy permeated the stuffing of a discarded and\nforgotten plush doll, giving it new life as Banette.\nThe Pokémon’s energy would escape if it were to ever open\nits mouth.",
            "name_en": "banette",
            "types": [
                "Ghost"
            ]
        },
        "355": {
            "flavor": "Duskull wanders lost among the deep darkness of midnight.\nThere is an oft-told admonishment given to misbehaving\nchildren that this Pokémon will spirit away bad children who\nearn scoldings from their mothers.",
            "name_en": "duskull",
            "types": [
                "Ghost"
            ]
        },
        "356": {
            "flavor": "Dusclops absorbs anything, however large the object may be.\nThis Pokémon hypnotizes its foe by waving its hands in a\nmacabre manner and by bringing its single eye to bear.\nThe hypnotized foe is made to do Dusclops’s bidding.",
            "name_en": "dusclops",
            "types": [
                "Ghost"
            ]
        },
        "357": {
            "flavor": "Children of the southern tropics eat as snacks the fruit that\ngrows in bunches around the neck of Tropius. This Pokémon\nflies by flapping the leaves on its back as if they were wings.",
            "name_en": "tropius",
            "types": [
                "Grass",
                "Flying"
            ]
        },
        "358": {
            "flavor": "In high winds, Chimecho cries as it hangs from a tree branch or\nthe eaves of a building using a suction cup on its head. This\nPokémon plucks berries with its long tail and eats them.",
            "name_en": "chimecho",
            "types": [
                "Psychic"
            ]
        },
        "359": {
            "flavor": "Absol has the ability to foretell the coming of natural disasters.\nIt lives in a harsh, rugged mountain environment. This\nPokémon very rarely ventures down from the mountains.",
            "name_en": "absol",
            "types": [
                "Dark"
            ]
        },
        "360": {
            "flavor": "Wynaut gather on moonlit nights to play by squeezing up\nagainst each other. By being squeezed, this Pokémon gains\nendurance and is trained to dole out powerful counterattacks.",
            "name_en": "wynaut",
            "types": [
                "Psychic"
            ]
        },
        "361": {
            "flavor": "Snorunt survives by eating only snow and ice. Old folklore\nclaims that a house visited by this Pokémon is sure to prosper\nfor many generations to come.",
            "name_en": "snorunt",
            "types": [
                "Ice"
            ]
        },
        "362": {
            "flavor": "Glalie has the ability to freely control ice. For example, it can\ninstantly freeze its prey solid. After immobilizing its prey in ice,\nthis Pokémon enjoys eating it in leisurely fashion.",
            "name_en": "glalie",
            "types": [
                "Ice"
            ]
        },
        "363": {
            "flavor": "Spheal always travels by rolling around on its ball-like body.\nWhen the season for ice floes arrives, this Pokémon can be\nseen rolling about on ice and crossing the sea.",
            "name_en": "spheal",
            "types": [
                "Ice",
                "Water"
            ]
        },
        "364": {
            "flavor": "Sealeo often balances and rolls things on the tip of its\nnose. While the Pokémon is rolling something, it checks\nthe object’s aroma and texture to determine whether it likes\nthe object or not.",
            "name_en": "sealeo",
            "types": [
                "Ice",
                "Water"
            ]
        },
        "365": {
            "flavor": "Walrein swims all over in frigid seawater while crushing\nicebergs with its grand, imposing tusks. Its thick layer of\nblubber makes enemy attacks bounce off harmlessly.",
            "name_en": "walrein",
            "types": [
                "Ice",
                "Water"
            ]
        },
        "366": {
            "flavor": "Clamperl grows while being protected by its rock-hard shell.\nWhen its body becomes too large to fit inside the shell, it is\nsure evidence that this Pokémon is getting close to evolution.",
            "name_en": "clamperl",
            "types": [
                "Water"
            ]
        },
        "367": {
            "flavor": "Huntail’s tail is shaped like a fish. It uses the tail to attract\nprey, then swallows the prey whole with its large, gaping\nmouth. This Pokémon swims by wiggling its slender body\nlike a snake.",
            "name_en": "huntail",
            "types": [
                "Water"
            ]
        },
        "368": {
            "flavor": "Although Gorebyss is the very picture of elegance and beauty\nwhile swimming, it is also cruel. When it spots prey, this\nPokémon inserts its thin mouth into the prey’s body and drains\nthe prey of its body fluids.",
            "name_en": "gorebyss",
            "types": [
                "Water"
            ]
        },
        "369": {
            "flavor": "Relicanth is a rare species that was discovered in deep-sea\nexplorations. This Pokémon’s body withstands the enormous\nwater pressure of the ocean depths. Its body is covered in\ntough scales that are like craggy rocks.",
            "name_en": "relicanth",
            "types": [
                "Water",
                "Rock"
            ]
        },
        "370": {
            "flavor": "Luvdisc’s heart-shaped body is a symbol of love and romance.\nIt is said that any couple meeting this Pokémon is promised a\nloving relationship that never ends.",
            "name_en": "luvdisc",
            "types": [
                "Water"
            ]
        },
        "371": {
            "flavor": "Bagon harbors a never-ending dream of one day soaring high\namong the clouds. As if trying to dispel its frustration over its\ninability to fly, this Pokémon slams its hard head against huge\nrocks and shatters them into pebbles.",
            "name_en": "bagon",
            "types": [
                "Dragon"
            ]
        },
        "372": {
            "flavor": "Covering Shelgon’s body are outgrowths much like bones.\nThe shell is very hard and bounces off enemy attacks.\nWhen awaiting evolution, this Pokémon hides away in a cavern.",
            "name_en": "shelgon",
            "types": [
                "Dragon"
            ]
        },
        "373": {
            "flavor": "By evolving into Salamence, this Pokémon finally\nrealizes its long-held dream of growing wings. To express\nits joy, it flies and wheels all over the sky while spouting\nflames from its mouth.",
            "name_en": "salamence",
            "types": [
                "Dragon",
                "Flying"
            ]
        },
        "374": {
            "flavor": "Beldum keeps itself floating by generating a magnetic force\nthat repels earth’s natural magnetism. When it sleeps, this\nPokémon anchors itself to a cliff using the hooks on its rear.",
            "name_en": "beldum",
            "types": [
                "Steel",
                "Psychic"
            ]
        },
        "375": {
            "flavor": "When two Beldum fuse together, Metang is formed.\nThe brains of the Beldum are joined by a magnetic\nnervous system. This Pokémon turns its arms to the\nrear for traveling at high speed.",
            "name_en": "metang",
            "types": [
                "Steel",
                "Psychic"
            ]
        },
        "376": {
            "flavor": "Metagross is the result of two Metang achieving fusion.\nWhen hunting, this Pokémon pins the prey to the ground under\nits massive body. It then eats the helpless victim using the\nlarge mouth on its stomach.",
            "name_en": "metagross",
            "types": [
                "Steel",
                "Psychic"
            ]
        },
        "377": {
            "flavor": "Regirock’s body is composed entirely of rocks. Recently,\na study made the startling discovery that the rocks were all\nunearthed from different locations.",
            "name_en": "regirock",
            "types": [
                "Rock"
            ]
        },
        "378": {
            "flavor": "Regice cloaks itself with frigid air of -328 degrees Fahrenheit.\nThings will freeze solid just by going near this Pokémon.\nIts icy body is so cold, it will not melt even if it is immersed\nin magma.",
            "name_en": "regice",
            "types": [
                "Ice"
            ]
        },
        "379": {
            "flavor": "Registeel was imprisoned by people in ancient times.\nThe metal composing its body is thought to be a curious\nsubstance that is not of this earth.",
            "name_en": "registeel",
            "types": [
                "Steel"
            ]
        },
        "380": {
            "flavor": "Latias is highly intelligent and capable of understanding\nhuman speech. It is covered with a glass-like down.\nThe Pokémon enfolds its body with its down and refracts\nlight to alter its appearance.",
            "name_en": "latias",
            "types": [
                "Dragon",
                "Psychic"
            ]
        },
        "381": {
            "flavor": "Latios will only open its heart to a Trainer with a\ncompassionate spirit. This Pokémon can fly faster than a\njet plane by folding its forelegs to minimize air resistance.",
            "name_en": "latios",
            "types": [
                "Dragon",
                "Psychic"
            ]
        },
        "382": {
            "flavor": "Kyogre is said to be the personification of the sea itself.\nLegends tell of its many clashes against Groudon,\nas each sought to gain the power of nature.",
            "name_en": "kyogre",
            "types": [
                "Water"
            ]
        },
        "383": {
            "flavor": "Through Primal Reversion and with nature’s full power,\nit will take back its true form. It can cause magma to\nerupt and expand the landmass of the world.",
            "name_en": "groudon",
            "types": [
                "Ground"
            ]
        },
        "384": {
            "flavor": "It flies forever through the ozone layer, consuming\nmeteoroids for sustenance. The many meteoroids\nin its body provide the energy it needs to Mega Evolve.",
            "name_en": "rayquaza",
            "types": [
                "Dragon",
                "Flying"
            ]
        },
        "385": {
            "flavor": "Jirachi will awaken from its sleep of a thousand years if you\nsing to it in a voice of purity. It is said to make true any wish\nthat people desire.",
            "name_en": "jirachi",
            "types": [
                "Steel",
                "Psychic"
            ]
        },
        "386": {
            "flavor": "Deoxys emerged from a virus that came from space. It is highly\nintelligent and wields psychokinetic powers. This Pokémon\nshoots lasers from the crystalline organ on its chest.",
            "name_en": "deoxys",
            "types": [
                "Normal",
                "Psychic"
            ]
        },
        "387": {
            "flavor": "It undertakes photosynthesis with its body, making\noxygen. The leaf on its head wilts if it is thirsty.",
            "name_en": "turtwig",
            "types": [
                "Grass"
            ]
        },
        "388": {
            "flavor": "It knows where pure water wells up. It carries fellow\nPokémon there on its back.",
            "name_en": "grotle",
            "types": [
                "Grass"
            ]
        },
        "389": {
            "flavor": "Small Pokémon occasionally gather on its unmoving\nback to begin building their nests.",
            "name_en": "torterra",
            "types": [
                "Grass",
                "Ground"
            ]
        },
        "390": {
            "flavor": "The gas made in its belly burns from its rear end.\nThe fire burns weakly when it feels sick.",
            "name_en": "chimchar",
            "types": [
                "Fire"
            ]
        },
        "391": {
            "flavor": "It uses ceilings and walls to launch aerial attacks.\nIts fiery tail is but one weapon.",
            "name_en": "monferno",
            "types": [
                "Fire",
                "Fighting"
            ]
        },
        "392": {
            "flavor": "It tosses its enemies around with agility. It uses all\nits limbs to fight in its own unique style.",
            "name_en": "infernape",
            "types": [
                "Fire",
                "Fighting"
            ]
        },
        "393": {
            "flavor": "Because it is very proud, it hates accepting food\nfrom people. Its thick down guards it from cold.",
            "name_en": "piplup",
            "types": [
                "Water"
            ]
        },
        "394": {
            "flavor": "It lives a solitary life. Its wings deliver wicked blows\nthat can snap even the thickest of trees.",
            "name_en": "prinplup",
            "types": [
                "Water"
            ]
        },
        "395": {
            "flavor": "The three horns that extend from its beak attest to\nits power. The leader has the biggest horns.",
            "name_en": "empoleon",
            "types": [
                "Water",
                "Steel"
            ]
        },
        "396": {
            "flavor": "They flock around mountains and fields, chasing\nafter bug Pokémon. Their singing is noisy\nand annoying.",
            "name_en": "starly",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "397": {
            "flavor": "It lives in forests and fields. Squabbles over\nterritory occur when flocks collide.",
            "name_en": "staravia",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "398": {
            "flavor": "When Staravia evolve into Staraptor, they leave the\nflock to live alone. They have sturdy wings.",
            "name_en": "staraptor",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "399": {
            "flavor": "It constantly gnaws on logs and rocks to whittle\ndown its front teeth. It nests alongside water.",
            "name_en": "bidoof",
            "types": [
                "Normal"
            ]
        },
        "400": {
            "flavor": "It makes its nest by damming streams with bark and\nmud. It is known as an industrious worker.",
            "name_en": "bibarel",
            "types": [
                "Normal",
                "Water"
            ]
        },
        "401": {
            "flavor": "When its antennae hit each other, it sounds like the\nmusic of a xylophone.",
            "name_en": "kricketot",
            "types": [
                "Bug"
            ]
        },
        "402": {
            "flavor": "It signals its emotions with its melodies. Scientists\nare studying these melodic patterns.",
            "name_en": "kricketune",
            "types": [
                "Bug"
            ]
        },
        "403": {
            "flavor": "All of its fur dazzles if danger is sensed. It flees\nwhile the foe is momentarily blinded.",
            "name_en": "shinx",
            "types": [
                "Electric"
            ]
        },
        "404": {
            "flavor": "Strong electricity courses through the tips of its\nsharp claws. A light scratch causes fainting in foes.",
            "name_en": "luxio",
            "types": [
                "Electric"
            ]
        },
        "405": {
            "flavor": "Luxray’s ability to see through objects comes in\nhandy when it’s scouting for danger.",
            "name_en": "luxray",
            "types": [
                "Electric"
            ]
        },
        "406": {
            "flavor": "Over the winter, it closes its bud and endures the\ncold. In spring, the bud opens and releases pollen.",
            "name_en": "budew",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "407": {
            "flavor": "With the movements of a dancer, it strikes with\nwhips that are densely lined with poison thorns.",
            "name_en": "roserade",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "408": {
            "flavor": "A lifelong jungle dweller from 100 million years\nago, it would snap obstructing trees with headbutts.",
            "name_en": "cranidos",
            "types": [
                "Rock"
            ]
        },
        "409": {
            "flavor": "Its skull is as hard as iron. It is a brute that tears\ndown jungle trees while catching prey.",
            "name_en": "rampardos",
            "types": [
                "Rock"
            ]
        },
        "410": {
            "flavor": "It was generated from a fossil dug out of a layer of\nclay that was older than anyone knows. It has a\nsturdy face.",
            "name_en": "shieldon",
            "types": [
                "Rock",
                "Steel"
            ]
        },
        "411": {
            "flavor": "Any frontal attack is repulsed. It is a docile\nPokémon that feeds on grass and berries.",
            "name_en": "bastiodon",
            "types": [
                "Rock",
                "Steel"
            ]
        },
        "412": {
            "flavor": "If its cloak is broken in battle, it quickly remakes\nthe cloak with materials nearby.",
            "name_en": "burmy",
            "types": [
                "Bug"
            ]
        },
        "413": {
            "flavor": "When Burmy evolved, its cloak became a part of\nthis Pokémon’s body. The cloak is never shed.",
            "name_en": "wormadam",
            "types": [
                "Bug",
                "Grass"
            ]
        },
        "414": {
            "flavor": "It flutters around at night and steals honey from\nthe Combee hive.",
            "name_en": "mothim",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "415": {
            "flavor": "It collects and delivers honey to its colony.\nAt night, they cluster to form a beehive and sleep.",
            "name_en": "combee",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "416": {
            "flavor": "Its abdomen is a honeycomb for grubs. It raises its\ngrubs on honey collected by Combee.",
            "name_en": "vespiquen",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "417": {
            "flavor": "A pair may be seen rubbing their cheek pouches\ntogether in an effort to share stored electricity.",
            "name_en": "pachirisu",
            "types": [
                "Electric"
            ]
        },
        "418": {
            "flavor": "It inflates the flotation sac around its neck and\npokes its head out of the water to see what is\ngoing on.",
            "name_en": "buizel",
            "types": [
                "Water"
            ]
        },
        "419": {
            "flavor": "Its flotation sac developed as a result of pursuing\naquatic prey. It can double as a rubber raft.",
            "name_en": "floatzel",
            "types": [
                "Water"
            ]
        },
        "420": {
            "flavor": "It evolves by sucking the energy out of the small\nball where it had been storing nutrients.",
            "name_en": "cherubi",
            "types": [
                "Grass"
            ]
        },
        "421": {
            "flavor": "If it senses strong sunlight, it opens its folded\npetals to absorb the sun’s rays with its whole body.",
            "name_en": "cherrim",
            "types": [
                "Grass"
            ]
        },
        "422": {
            "flavor": "Its shape and coloration vary, depending on\nits habitat.",
            "name_en": "shellos",
            "types": [
                "Water"
            ]
        },
        "423": {
            "flavor": "It apparently had a huge shell for protection in\nancient times. It lives in shallow tidal pools.",
            "name_en": "gastrodon",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "424": {
            "flavor": "To eat, it deftly shucks nuts with its two tails.\nIt rarely uses its arms now.",
            "name_en": "ambipom",
            "types": [
                "Normal"
            ]
        },
        "425": {
            "flavor": "These Pokémon are called the “Signpost for\nWandering Spirits.” Children holding them\nsometimes vanish.",
            "name_en": "drifloon",
            "types": [
                "Ghost",
                "Flying"
            ]
        },
        "426": {
            "flavor": "It’s drowsy in daytime, but flies off in the evening in\nbig groups. No one knows where they go.",
            "name_en": "drifblim",
            "types": [
                "Ghost",
                "Flying"
            ]
        },
        "427": {
            "flavor": "When it senses danger, it perks up its ears.\nOn cold nights, it sleeps with its head tucked into\nits fur.",
            "name_en": "buneary",
            "types": [
                "Normal"
            ]
        },
        "428": {
            "flavor": "The ears appear to be delicate. If they are touched\nroughly, it kicks with its graceful legs.",
            "name_en": "lopunny",
            "types": [
                "Normal"
            ]
        },
        "429": {
            "flavor": "Its cries sound like incantations to torment the foe.\nIt appears where you least expect it.",
            "name_en": "mismagius",
            "types": [
                "Ghost"
            ]
        },
        "430": {
            "flavor": "Becoming active at night, it is known to swarm with\nnumerous Murkrow in tow.",
            "name_en": "honchkrow",
            "types": [
                "Dark",
                "Flying"
            ]
        },
        "431": {
            "flavor": "When it’s happy, Glameow demonstrates beautiful\nmovements of its tail, like a dancing ribbon.",
            "name_en": "glameow",
            "types": [
                "Normal"
            ]
        },
        "432": {
            "flavor": "To make itself appear intimidatingly beefy, it tightly\ncinches its waist with its twin tails.",
            "name_en": "purugly",
            "types": [
                "Normal"
            ]
        },
        "433": {
            "flavor": "There is an orb inside its mouth. When it hops,\nthe orb bounces all over and makes a\nringing sound.",
            "name_en": "chingling",
            "types": [
                "Psychic"
            ]
        },
        "434": {
            "flavor": "It protects itself by spraying a noxious fluid from its\nrear. The stench lingers for 24 hours.",
            "name_en": "stunky",
            "types": [
                "Poison",
                "Dark"
            ]
        },
        "435": {
            "flavor": "It sprays a stinky fluid from its tail. The fluid smells\nworse the longer it is allowed to fester.",
            "name_en": "skuntank",
            "types": [
                "Poison",
                "Dark"
            ]
        },
        "436": {
            "flavor": "Implements shaped like it were discovered in\nancient tombs. It is unknown if they are related.",
            "name_en": "bronzor",
            "types": [
                "Steel",
                "Psychic"
            ]
        },
        "437": {
            "flavor": "Ancient people believed that petitioning Bronzong\nfor rain was the way to make crops grow.",
            "name_en": "bronzong",
            "types": [
                "Steel",
                "Psychic"
            ]
        },
        "438": {
            "flavor": "It prefers an arid atmosphere. It leaks water that\nlooks like tears when adjusting its moisture level.",
            "name_en": "bonsly",
            "types": [
                "Rock"
            ]
        },
        "439": {
            "flavor": "It habitually mimics foes. Once mimicked, the foe\ncannot take its eyes off this Pokémon.",
            "name_en": "mime jr.",
            "types": [
                "Psychic",
                "Fairy"
            ]
        },
        "440": {
            "flavor": "It carefully carries a round, white rock that it thinks\nis an egg. It’s bothered by how curly its hair looks.",
            "name_en": "happiny",
            "types": [
                "Normal"
            ]
        },
        "441": {
            "flavor": "It can learn and speak human words. If they gather,\nthey all learn the same saying.",
            "name_en": "chatot",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "442": {
            "flavor": "It was bound to a fissure in an odd keystone as\npunishment for misdeeds 500 years ago.",
            "name_en": "spiritomb",
            "types": [
                "Ghost",
                "Dark"
            ]
        },
        "443": {
            "flavor": "It nests in small, horizontal holes in cave walls.\nIt pounces to catch prey that stray too close.",
            "name_en": "gible",
            "types": [
                "Dragon",
                "Ground"
            ]
        },
        "444": {
            "flavor": "As it digs to expand its nest, it habitually digs up\ngems that it then hoards in its nest.",
            "name_en": "gabite",
            "types": [
                "Dragon",
                "Ground"
            ]
        },
        "445": {
            "flavor": "It flies at speeds equal to a jet fighter plane.\nIt never allows its prey to escape.",
            "name_en": "garchomp",
            "types": [
                "Dragon",
                "Ground"
            ]
        },
        "446": {
            "flavor": "It conceals food under the long fur on its body.\nIt carts around this food stash and swallows it\nwithout chewing.",
            "name_en": "munchlax",
            "types": [
                "Normal"
            ]
        },
        "447": {
            "flavor": "The aura that emanates from its body intensifies to\nalert others if it is afraid or sad.",
            "name_en": "riolu",
            "types": [
                "Fighting"
            ]
        },
        "448": {
            "flavor": "By reading the auras of all things, it can tell how\nothers are feeling from over half a mile away.",
            "name_en": "lucario",
            "types": [
                "Fighting",
                "Steel"
            ]
        },
        "449": {
            "flavor": "It enshrouds itself with sand to protect itself from\ngerms. It does not enjoy getting wet.",
            "name_en": "hippopotas",
            "types": [
                "Ground"
            ]
        },
        "450": {
            "flavor": "It blasts internally stored sand from ports on its\nbody to create a towering twister for attack.",
            "name_en": "hippowdon",
            "types": [
                "Ground"
            ]
        },
        "451": {
            "flavor": "It burrows under the sand to lie in wait for prey.\nIts tail claws can inject its prey with a\nsavage poison.",
            "name_en": "skorupi",
            "types": [
                "Poison",
                "Bug"
            ]
        },
        "452": {
            "flavor": "It has the power in its clawed arms to make scrap\nof a car. The tips of its claws release poison.",
            "name_en": "drapion",
            "types": [
                "Poison",
                "Dark"
            ]
        },
        "453": {
            "flavor": "Inflating its poison sacs, it fills the area with an odd\nsound and hits flinching opponents with a\npoison jab.",
            "name_en": "croagunk",
            "types": [
                "Poison",
                "Fighting"
            ]
        },
        "454": {
            "flavor": "Its knuckle claws secrete a toxin so vile that even a\nscratch could prove fatal.",
            "name_en": "toxicroak",
            "types": [
                "Poison",
                "Fighting"
            ]
        },
        "455": {
            "flavor": "It binds itself to trees in marshes. It attracts prey\nwith its sweet-smelling drool and gulps them down.",
            "name_en": "carnivine",
            "types": [
                "Grass"
            ]
        },
        "456": {
            "flavor": "After long exposure to sunlight, the patterns on its\ntail fins shine vividly when darkness arrives.",
            "name_en": "finneon",
            "types": [
                "Water"
            ]
        },
        "457": {
            "flavor": "To avoid detection by predators, it crawls along the\nseafloor using the two fins on its chest.",
            "name_en": "lumineon",
            "types": [
                "Water"
            ]
        },
        "458": {
            "flavor": "When it swims close to the surface of the ocean,\npeople aboard ships are able to observe the pattern\non its back.",
            "name_en": "mantyke",
            "types": [
                "Water",
                "Flying"
            ]
        },
        "459": {
            "flavor": "In the spring, it grows berries with the texture of\nfrozen treats around its belly.",
            "name_en": "snover",
            "types": [
                "Grass",
                "Ice"
            ]
        },
        "460": {
            "flavor": "It lives a quiet life on mountains that are perpetually\ncovered in snow. It hides itself by whipping\nup blizzards.",
            "name_en": "abomasnow",
            "types": [
                "Grass",
                "Ice"
            ]
        },
        "461": {
            "flavor": "They live in cold regions, forming groups of four or\nfive that hunt prey with impressive coordination.",
            "name_en": "weavile",
            "types": [
                "Dark",
                "Ice"
            ]
        },
        "462": {
            "flavor": "It evolved from exposure to a special magnetic\nfield. Three units generate magnetism.",
            "name_en": "magnezone",
            "types": [
                "Electric",
                "Steel"
            ]
        },
        "463": {
            "flavor": "Their saliva contains lots of components that can\ndissolve anything. The numbness caused by their\nlick does not dissipate.",
            "name_en": "lickilicky",
            "types": [
                "Normal"
            ]
        },
        "464": {
            "flavor": "It puts rocks in holes in its palms and uses its\nmuscles to shoot them. Geodude are shot at\nrare times.",
            "name_en": "rhyperior",
            "types": [
                "Ground",
                "Rock"
            ]
        },
        "465": {
            "flavor": "Its vines grow so profusely that, in the warm\nseason, you can’t even see its eyes.",
            "name_en": "tangrowth",
            "types": [
                "Grass"
            ]
        },
        "466": {
            "flavor": "It pushes the tips of its two tails against the foe,\nthen lets loose with over 20,000 volts of power.",
            "name_en": "electivire",
            "types": [
                "Electric"
            ]
        },
        "467": {
            "flavor": "It blasts fireballs of over 3,600 degrees Fahrenheit\nout of its arms. Its breath also sears and sizzles.",
            "name_en": "magmortar",
            "types": [
                "Fire"
            ]
        },
        "468": {
            "flavor": "It shares many blessings with people who respect\none another’s rights and avoid needless strife.",
            "name_en": "togekiss",
            "types": [
                "Fairy",
                "Flying"
            ]
        },
        "469": {
            "flavor": "This six-legged Pokémon is easily capable of\ntransporting an adult in flight. The wings on its tail\nhelp it stay balanced.",
            "name_en": "yanmega",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "470": {
            "flavor": "Just like a plant, it uses photosynthesis. As a result,\nit is always enveloped in clear air.",
            "name_en": "leafeon",
            "types": [
                "Grass"
            ]
        },
        "471": {
            "flavor": "It lowers its body heat to freeze its fur. The hairs\nthen become like needles it can fire.",
            "name_en": "glaceon",
            "types": [
                "Ice"
            ]
        },
        "472": {
            "flavor": "Its flight is soundless. It uses its lengthy tail to\ncarry off its prey... Then its elongated fangs do\nthe rest.",
            "name_en": "gliscor",
            "types": [
                "Ground",
                "Flying"
            ]
        },
        "473": {
            "flavor": "Its impressive tusks are made of ice. The population\nthinned when it turned warm after the ice age.",
            "name_en": "mamoswine",
            "types": [
                "Ice",
                "Ground"
            ]
        },
        "474": {
            "flavor": "Its programming was modified to enable it to travel\nthrough alien dimensions. Seems there might have\nbeen an error...",
            "name_en": "porygon-z",
            "types": [
                "Normal"
            ]
        },
        "475": {
            "flavor": "A master of courtesy and swordsmanship, it fights\nusing extending swords on its elbows.",
            "name_en": "gallade",
            "types": [
                "Psychic",
                "Fighting"
            ]
        },
        "476": {
            "flavor": "It freely controls three small units called Mini-Noses\nusing magnetic force.",
            "name_en": "probopass",
            "types": [
                "Rock",
                "Steel"
            ]
        },
        "477": {
            "flavor": "The antenna on its head captures radio waves from\nthe world of spirits that command it to take\npeople there.",
            "name_en": "dusknoir",
            "types": [
                "Ghost"
            ]
        },
        "478": {
            "flavor": "Legends in snowy regions say that a woman who\nwas lost on an icy mountain was reborn as Froslass.",
            "name_en": "froslass",
            "types": [
                "Ice",
                "Ghost"
            ]
        },
        "479": {
            "flavor": "Its body is composed of plasma. It is known to\ninfiltrate electronic devices and wreak havoc.",
            "name_en": "rotom",
            "types": [
                "Electric",
                "Ghost"
            ]
        },
        "480": {
            "flavor": "It is said that its emergence gave humans the\nintelligence to improve their quality of life.",
            "name_en": "uxie",
            "types": [
                "Psychic"
            ]
        },
        "481": {
            "flavor": "It sleeps at the bottom of a lake. Its spirit is said to\nleave its body to fly on the lake’s surface.",
            "name_en": "mesprit",
            "types": [
                "Psychic"
            ]
        },
        "482": {
            "flavor": "It is thought that Uxie, Mesprit, and Azelf all came\nfrom the same egg.",
            "name_en": "azelf",
            "types": [
                "Psychic"
            ]
        },
        "483": {
            "flavor": "It has the power to control time. It appears in\nSinnoh-region myths as an ancient deity.",
            "name_en": "dialga",
            "types": [
                "Steel",
                "Dragon"
            ]
        },
        "484": {
            "flavor": "It has the ability to distort space. It is described as\na deity in Sinnoh-region mythology.",
            "name_en": "palkia",
            "types": [
                "Water",
                "Dragon"
            ]
        },
        "485": {
            "flavor": "Boiling blood, like magma, circulates through its\nbody. It makes its dwelling place in volcanic caves.",
            "name_en": "heatran",
            "types": [
                "Fire",
                "Steel"
            ]
        },
        "486": {
            "flavor": "There is an enduring legend that states this\nPokémon towed continents with ropes.",
            "name_en": "regigigas",
            "types": [
                "Normal"
            ]
        },
        "487": {
            "flavor": "It was banished for its violence. It silently gazed\nupon the old world from the Distortion World.",
            "name_en": "giratina",
            "types": [
                "Ghost",
                "Dragon"
            ]
        },
        "488": {
            "flavor": "Those who sleep holding Cresselia’s feather are\nassured of joyful dreams. It is said to represent\nthe crescent moon.",
            "name_en": "cresselia",
            "types": [
                "Psychic"
            ]
        },
        "489": {
            "flavor": "It drifts in warm seas. It always returns to where it\nwas born, no matter how far it may have drifted.",
            "name_en": "phione",
            "types": [
                "Water"
            ]
        },
        "490": {
            "flavor": "It starts its life with a wondrous power that permits\nit to bond with any kind of Pokémon.",
            "name_en": "manaphy",
            "types": [
                "Water"
            ]
        },
        "491": {
            "flavor": "It can lull people to sleep and make them dream.\nIt is active during nights of the new moon.",
            "name_en": "darkrai",
            "types": [
                "Dark"
            ]
        },
        "492": {
            "flavor": "The blooming of Gracidea flowers confers the\npower of flight upon it. Feelings of gratitude are\nthe message it delivers.",
            "name_en": "shaymin",
            "types": [
                "Grass"
            ]
        },
        "493": {
            "flavor": "It is told in mythology that this Pokémon was born\nbefore the universe even existed.",
            "name_en": "arceus",
            "types": [
                "Normal"
            ]
        },
        "494": {
            "flavor": "When it shares the infinite energy it creates,\nthat being’s entire body will be overflowing\nwith power.",
            "name_en": "victini",
            "types": [
                "Psychic",
                "Fire"
            ]
        },
        "495": {
            "flavor": "They photosynthesize by bathing their tails in\nsunlight. When they are not feeling well, their\ntails droop.",
            "name_en": "snivy",
            "types": [
                "Grass"
            ]
        },
        "496": {
            "flavor": "When it gets dirty, its leaves can’t be used in\nphotosynthesis, so it always keeps itself clean.",
            "name_en": "servine",
            "types": [
                "Grass"
            ]
        },
        "497": {
            "flavor": "It can stop its opponents’ movements with just a\nglare. It takes in solar energy and boosts\nit internally.",
            "name_en": "serperior",
            "types": [
                "Grass"
            ]
        },
        "498": {
            "flavor": "It loves to eat roasted berries, but sometimes it\ngets too excited and burns them to a crisp.",
            "name_en": "tepig",
            "types": [
                "Fire"
            ]
        },
        "499": {
            "flavor": "When its internal fire flares up, its movements grow\nsharper and faster. When in trouble, it emits smoke.",
            "name_en": "pignite",
            "types": [
                "Fire",
                "Fighting"
            ]
        },
        "500": {
            "flavor": "It has mastered fast and powerful fighting moves.\nIt grows a beard of fire.",
            "name_en": "emboar",
            "types": [
                "Fire",
                "Fighting"
            ]
        },
        "501": {
            "flavor": "It fights using the scalchop on its stomach.\nIn response to an attack, it retaliates immediately\nby slashing.",
            "name_en": "oshawott",
            "types": [
                "Water"
            ]
        },
        "502": {
            "flavor": "As a result of strict training, each Dewott learns\ndifferent forms for using the scalchops.",
            "name_en": "dewott",
            "types": [
                "Water"
            ]
        },
        "503": {
            "flavor": "One swing of the sword incorporated in its armor\ncan fell an opponent. A simple glare from one of\nthem quiets everybody.",
            "name_en": "samurott",
            "types": [
                "Water"
            ]
        },
        "504": {
            "flavor": "Extremely cautious, one of them will always be on\nthe lookout, but it won’t notice a foe coming\nfrom behind.",
            "name_en": "patrat",
            "types": [
                "Normal"
            ]
        },
        "505": {
            "flavor": "When they see an enemy, their tails stand high,\nand they spit the seeds of berries stored in their\ncheek pouches.",
            "name_en": "watchog",
            "types": [
                "Normal"
            ]
        },
        "506": {
            "flavor": "Though it is a very brave Pokémon, it’s also smart\nenough to check its foe’s strength and avoid battle.",
            "name_en": "lillipup",
            "types": [
                "Normal"
            ]
        },
        "507": {
            "flavor": "It has black, cape-like fur that is very hard and\ndecreases the amount of damage it receives.",
            "name_en": "herdier",
            "types": [
                "Normal"
            ]
        },
        "508": {
            "flavor": "Being wrapped in its long fur is so comfortable\nthat a person would be fine even overnight on a\nwintry mountain.",
            "name_en": "stoutland",
            "types": [
                "Normal"
            ]
        },
        "509": {
            "flavor": "They steal from people for fun, but their victims\ncan’t help but forgive them. Their deceptively cute\nact is perfect.",
            "name_en": "purrloin",
            "types": [
                "Dark"
            ]
        },
        "510": {
            "flavor": "Stealthily, it sneaks up on its target, striking from\nbehind before its victim has a chance to react.",
            "name_en": "liepard",
            "types": [
                "Dark"
            ]
        },
        "511": {
            "flavor": "It’s good at finding berries and gathers them from\nall over. It’s kind enough to share them\nwith friends.",
            "name_en": "pansage",
            "types": [
                "Grass"
            ]
        },
        "512": {
            "flavor": "Ill tempered, it fights by swinging its barbed tail\naround wildly. The leaf growing on its head is\nvery bitter.",
            "name_en": "simisage",
            "types": [
                "Grass"
            ]
        },
        "513": {
            "flavor": "This Pokémon lives in caves in volcanoes.\nThe fire within the tuft on its head can reach\n600 degrees Fahrenheit.",
            "name_en": "pansear",
            "types": [
                "Fire"
            ]
        },
        "514": {
            "flavor": "When it gets excited, embers rise from its head\nand tail and it gets hot. For some reason, it\nloves sweets.",
            "name_en": "simisear",
            "types": [
                "Fire"
            ]
        },
        "515": {
            "flavor": "The water stored inside the tuft on its head is full of\nnutrients. Plants that receive its water grow large.",
            "name_en": "panpour",
            "types": [
                "Water"
            ]
        },
        "516": {
            "flavor": "It prefers places with clean water. When its tuft runs\nlow, it replenishes it by siphoning up water with\nits tail.",
            "name_en": "simipour",
            "types": [
                "Water"
            ]
        },
        "517": {
            "flavor": "It eats the dreams of people and Pokémon. When it\neats a pleasant dream, it expels pink-colored mist.",
            "name_en": "munna",
            "types": [
                "Psychic"
            ]
        },
        "518": {
            "flavor": "The dream mist coming from its forehead changes\ninto many different colors depending on the dream\nthat was eaten.",
            "name_en": "musharna",
            "types": [
                "Psychic"
            ]
        },
        "519": {
            "flavor": "These Pokémon live in cities. They are accustomed\nto people. Flocks often gather in parks and plazas.",
            "name_en": "pidove",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "520": {
            "flavor": "No matter where in the world it goes, it knows\nwhere its nest is, so it never gets separated from\nits Trainer.",
            "name_en": "tranquill",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "521": {
            "flavor": "Males have plumage on their heads. They will never\nlet themselves feel close to anyone other than\ntheir Trainers.",
            "name_en": "unfezant",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "522": {
            "flavor": "Its mane shines when it discharges electricity.\nThey use the frequency and rhythm of these flashes\nto communicate.",
            "name_en": "blitzle",
            "types": [
                "Electric"
            ]
        },
        "523": {
            "flavor": "They have lightning-like movements.\nWhen Zebstrika run at full speed, the sound of\nthunder reverberates.",
            "name_en": "zebstrika",
            "types": [
                "Electric"
            ]
        },
        "524": {
            "flavor": "They were discovered a hundred years ago in an\nearthquake fissure. Inside each one is an\nenergy core.",
            "name_en": "roggenrola",
            "types": [
                "Rock"
            ]
        },
        "525": {
            "flavor": "When it is healthy, its core sticks out. Always facing\nthe same way, it swiftly moves front to back and left\nto right.",
            "name_en": "boldore",
            "types": [
                "Rock"
            ]
        },
        "526": {
            "flavor": "Compressing the energy from its internal core\nlets it fire off an attack capable of blowing away\na mountain.",
            "name_en": "gigalith",
            "types": [
                "Rock"
            ]
        },
        "527": {
            "flavor": "The heart-shaped mark left on a body after a\nWoobat has been attached to it is said to bring\ngood fortune.",
            "name_en": "woobat",
            "types": [
                "Psychic",
                "Flying"
            ]
        },
        "528": {
            "flavor": "Anyone who comes into contact with the ultrasonic\nwaves emitted by a courting male experiences a\npositive mood shift.",
            "name_en": "swoobat",
            "types": [
                "Psychic",
                "Flying"
            ]
        },
        "529": {
            "flavor": "By spinning its body, it can dig straight through the\nground at a speed of 30 mph.",
            "name_en": "drilbur",
            "types": [
                "Ground"
            ]
        },
        "530": {
            "flavor": "More than 300 feet below the surface, they build\nmazelike nests. Their activity can be destructive to\nsubway tunnels.",
            "name_en": "excadrill",
            "types": [
                "Ground",
                "Steel"
            ]
        },
        "531": {
            "flavor": "It touches others with the feelers on its ears, using\nthe sound of their heartbeats to tell how they\nare feeling.",
            "name_en": "audino",
            "types": [
                "Normal"
            ]
        },
        "532": {
            "flavor": "Always carrying squared logs, they help out with\nconstruction. As they grow, they carry bigger logs.",
            "name_en": "timburr",
            "types": [
                "Fighting"
            ]
        },
        "533": {
            "flavor": "This Pokémon is so muscular and strongly built that\neven a group of wrestlers could not make it budge\nan inch.",
            "name_en": "gurdurr",
            "types": [
                "Fighting"
            ]
        },
        "534": {
            "flavor": "Rather than rely on force, they master moves that\nutilize the centrifugal force of spinning concrete.",
            "name_en": "conkeldurr",
            "types": [
                "Fighting"
            ]
        },
        "535": {
            "flavor": "By vibrating its cheeks, it emits sound waves\nimperceptible to humans. It uses the rhythm of\nthese sounds to talk.",
            "name_en": "tympole",
            "types": [
                "Water"
            ]
        },
        "536": {
            "flavor": "It lives in the water and on land. It uses its long,\nsticky tongue to immobilize its opponents.",
            "name_en": "palpitoad",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "537": {
            "flavor": "They shoot paralyzing liquid from their head bumps.\nThey use vibration to hurt their opponents.",
            "name_en": "seismitoad",
            "types": [
                "Water",
                "Ground"
            ]
        },
        "538": {
            "flavor": "When it encounters a foe bigger than itself, it wants\nto throw it. It changes belts as it gets stronger.",
            "name_en": "throh",
            "types": [
                "Fighting"
            ]
        },
        "539": {
            "flavor": "Tying their belts gets them pumped and makes their\npunches more destructive. Disturbing their training\nangers them.",
            "name_en": "sawk",
            "types": [
                "Fighting"
            ]
        },
        "540": {
            "flavor": "Since this Pokémon makes its own clothes out of\nleaves, it is a popular mascot for fashion designers.",
            "name_en": "sewaddle",
            "types": [
                "Bug",
                "Grass"
            ]
        },
        "541": {
            "flavor": "It protects itself from the cold by wrapping up in\nleaves. It stays on the move, eating leaves\nin forests.",
            "name_en": "swadloon",
            "types": [
                "Bug",
                "Grass"
            ]
        },
        "542": {
            "flavor": "It keeps its eggs warm with heat from fermenting\nleaves. It also uses leaves to make warm wrappings\nfor Sewaddle.",
            "name_en": "leavanny",
            "types": [
                "Bug",
                "Grass"
            ]
        },
        "543": {
            "flavor": "Its bite injects a potent poison, enough to paralyze\nlarge bird Pokémon that try to prey on it.",
            "name_en": "venipede",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "544": {
            "flavor": "It is usually motionless, but when attacked,\nit rotates at high speed and then crashes into\nits opponent.",
            "name_en": "whirlipede",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "545": {
            "flavor": "With quick movements, it chases down its foes,\nattacking relentlessly with its horns until it prevails.",
            "name_en": "scolipede",
            "types": [
                "Bug",
                "Poison"
            ]
        },
        "546": {
            "flavor": "Perhaps because they feel more at ease in a group,\nthey stick to others they find. They end up looking\nlike a cloud.",
            "name_en": "cottonee",
            "types": [
                "Grass",
                "Fairy"
            ]
        },
        "547": {
            "flavor": "Like the wind, it can slip through any gap,\nno matter how small. It leaves balls of white\nfluff behind.",
            "name_en": "whimsicott",
            "types": [
                "Grass",
                "Fairy"
            ]
        },
        "548": {
            "flavor": "Since they prefer moist, nutrient-rich soil, the areas\nwhere Petilil live are known to be good for\ngrowing plants.",
            "name_en": "petilil",
            "types": [
                "Grass"
            ]
        },
        "549": {
            "flavor": "Even veteran Trainers face a challenge in getting its\nbeautiful flower to bloom. This Pokémon is popular\nwith celebrities.",
            "name_en": "lilligant",
            "types": [
                "Grass"
            ]
        },
        "550": {
            "flavor": "Red and blue Basculin usually do not get along,\nbut sometimes members of one school mingle with\nthe other’s school.",
            "name_en": "basculin",
            "types": [
                "Water"
            ]
        },
        "551": {
            "flavor": "They live buried in the sands of the desert.\nThe sun-warmed sands prevent their body\ntemperature from dropping.",
            "name_en": "sandile",
            "types": [
                "Ground",
                "Dark"
            ]
        },
        "552": {
            "flavor": "The special membrane covering its eyes can sense\nthe heat of objects, so it can see its surroundings\neven in darkness.",
            "name_en": "krokorok",
            "types": [
                "Ground",
                "Dark"
            ]
        },
        "553": {
            "flavor": "They never allow prey to escape. Their jaws\nare so powerful, they can crush the body of\nan automobile.",
            "name_en": "krookodile",
            "types": [
                "Ground",
                "Dark"
            ]
        },
        "554": {
            "flavor": "When it sleeps, it pulls its limbs into its\nbody and its internal fire goes down to\n1,100 degrees Fahrenheit.",
            "name_en": "darumaka",
            "types": [
                "Fire"
            ]
        },
        "555": {
            "flavor": "Its internal fire burns at 2,500 degrees Fahrenheit,\nmaking enough power that it can destroy a dump\ntruck with one punch.",
            "name_en": "darmanitan",
            "types": [
                "Fire"
            ]
        },
        "556": {
            "flavor": "Arid regions are their habitat. They move\nrhythmically, making a sound similar to maracas.",
            "name_en": "maractus",
            "types": [
                "Grass"
            ]
        },
        "557": {
            "flavor": "When it finds a stone of a suitable size, it secretes\na liquid from its mouth to open up a hole to\ncrawl into.",
            "name_en": "dwebble",
            "types": [
                "Bug",
                "Rock"
            ]
        },
        "558": {
            "flavor": "Competing for territory, Crustle fight viciously.\nThe one whose boulder is broken is the loser of\nthe battle.",
            "name_en": "crustle",
            "types": [
                "Bug",
                "Rock"
            ]
        },
        "559": {
            "flavor": "Proud of its sturdy skull, it suddenly headbutts\neverything, but its weight makes it unstable, too.",
            "name_en": "scraggy",
            "types": [
                "Dark",
                "Fighting"
            ]
        },
        "560": {
            "flavor": "It can smash concrete blocks with its kicking\nattacks. The one with the biggest crest is the\ngroup leader.",
            "name_en": "scrafty",
            "types": [
                "Dark",
                "Fighting"
            ]
        },
        "561": {
            "flavor": "The guardians of an ancient city, they always fly\nthe same route while keeping watch for invaders.",
            "name_en": "sigilyph",
            "types": [
                "Psychic",
                "Flying"
            ]
        },
        "562": {
            "flavor": "Each of them carries a mask that used to be its face\nwhen it was human. Sometimes they look at it\nand cry.",
            "name_en": "yamask",
            "types": [
                "Ghost"
            ]
        },
        "563": {
            "flavor": "Grave robbers who mistake them for real coffins and\nget too close end up trapped inside their bodies.",
            "name_en": "cofagrigus",
            "types": [
                "Ghost"
            ]
        },
        "564": {
            "flavor": "Restored from a fossil, this Pokémon can dive to\ndepths beyond half a mile.",
            "name_en": "tirtouga",
            "types": [
                "Water",
                "Rock"
            ]
        },
        "565": {
            "flavor": "It could knock out a foe with a slap from one of its\ndeveloped front appendages and chew it up, shell\nor bones and all.",
            "name_en": "carracosta",
            "types": [
                "Water",
                "Rock"
            ]
        },
        "566": {
            "flavor": "Said to be an ancestor of bird Pokémon, they were\nunable to fly and moved about by hopping from one\nbranch to another.",
            "name_en": "archen",
            "types": [
                "Rock",
                "Flying"
            ]
        },
        "567": {
            "flavor": "It runs better than it flies. It takes off into the sky\nby running at a speed of 25 mph.",
            "name_en": "archeops",
            "types": [
                "Rock",
                "Flying"
            ]
        },
        "568": {
            "flavor": "Inhaling the gas they belch will make you sleep for\na week. They prefer unsanitary places.",
            "name_en": "trubbish",
            "types": [
                "Poison"
            ]
        },
        "569": {
            "flavor": "Consuming garbage makes new kinds of poison\ngases and liquids inside their bodies.",
            "name_en": "garbodor",
            "types": [
                "Poison"
            ]
        },
        "570": {
            "flavor": "To protect themselves from danger, they hide their\ntrue identities by transforming into people\nand Pokémon.",
            "name_en": "zorua",
            "types": [
                "Dark"
            ]
        },
        "571": {
            "flavor": "Bonds between these Pokémon are very strong.\nIt protects the safety of its pack by tricking\nits opponents.",
            "name_en": "zoroark",
            "types": [
                "Dark"
            ]
        },
        "572": {
            "flavor": "These Pokémon prefer a tidy habitat. They are\nalways sweeping and dusting, using their tails\nas brooms.",
            "name_en": "minccino",
            "types": [
                "Normal"
            ]
        },
        "573": {
            "flavor": "Cinccino’s body is coated in a special oil that helps\nit deflect attacks, such as punches.",
            "name_en": "cinccino",
            "types": [
                "Normal"
            ]
        },
        "574": {
            "flavor": "They intently observe both Trainers and Pokémon.\nApparently, they are looking at something that only\nGothita can see.",
            "name_en": "gothita",
            "types": [
                "Psychic"
            ]
        },
        "575": {
            "flavor": "According to many old tales, it creates friends for\nitself by controlling sleeping children on\nstarry nights.",
            "name_en": "gothorita",
            "types": [
                "Psychic"
            ]
        },
        "576": {
            "flavor": "They can predict the future from the placement and\nmovement of the stars. They can see Trainers’\nlife spans.",
            "name_en": "gothitelle",
            "types": [
                "Psychic"
            ]
        },
        "577": {
            "flavor": "They drive away attackers by unleashing psychic\npower. They can use telepathy to talk with others.",
            "name_en": "solosis",
            "types": [
                "Psychic"
            ]
        },
        "578": {
            "flavor": "When their two divided brains think the same\nthoughts, their psychic power is maximized.",
            "name_en": "duosion",
            "types": [
                "Psychic"
            ]
        },
        "579": {
            "flavor": "When Reuniclus shake hands, a network forms\nbetween their brains, increasing their\npsychic power.",
            "name_en": "reuniclus",
            "types": [
                "Psychic"
            ]
        },
        "580": {
            "flavor": "They are better at swimming than flying, and they\nhappily eat their favorite food, peat moss, as they\ndive underwater.",
            "name_en": "ducklett",
            "types": [
                "Water",
                "Flying"
            ]
        },
        "581": {
            "flavor": "Swanna start to dance at dusk. The one dancing in\nthe middle is the leader of the flock.",
            "name_en": "swanna",
            "types": [
                "Water",
                "Flying"
            ]
        },
        "582": {
            "flavor": "This Pokémon formed from icicles bathed in energy\nfrom the morning sun. It sleeps buried in snow.",
            "name_en": "vanillite",
            "types": [
                "Ice"
            ]
        },
        "583": {
            "flavor": "Snowy mountains are this Pokémon’s habitat.\nDuring an ancient ice age, they moved to\nsouthern areas.",
            "name_en": "vanillish",
            "types": [
                "Ice"
            ]
        },
        "584": {
            "flavor": "Swallowing large amounts of water, they make\nsnow clouds inside their bodies and, when angry,\ncause violent blizzards.",
            "name_en": "vanilluxe",
            "types": [
                "Ice"
            ]
        },
        "585": {
            "flavor": "The turning of the seasons changes the color and\nscent of this Pokémon’s fur. People use it to mark\nthe seasons.",
            "name_en": "deerling",
            "types": [
                "Normal",
                "Grass"
            ]
        },
        "586": {
            "flavor": "They migrate according to the seasons, so some\npeople call Sawsbuck the harbingers of spring.",
            "name_en": "sawsbuck",
            "types": [
                "Normal",
                "Grass"
            ]
        },
        "587": {
            "flavor": "The energy made in its cheeks’ electric pouches is\nstored inside its membrane and released while it\nis gliding.",
            "name_en": "emolga",
            "types": [
                "Electric",
                "Flying"
            ]
        },
        "588": {
            "flavor": "For some reason they evolve when they receive\nelectrical energy while they are attacking Shelmet.",
            "name_en": "karrablast",
            "types": [
                "Bug"
            ]
        },
        "589": {
            "flavor": "These Pokémon evolve by wearing the shell\ncovering of a Shelmet. The steel armor protects\ntheir whole body.",
            "name_en": "escavalier",
            "types": [
                "Bug",
                "Steel"
            ]
        },
        "590": {
            "flavor": "It lures Pokémon with its pattern that looks just like\na Poké Ball, then releases poison spores.",
            "name_en": "foongus",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "591": {
            "flavor": "It lures prey close by dancing and waving its\narm caps, which resemble Poké Balls, in a\nswaying motion.",
            "name_en": "amoonguss",
            "types": [
                "Grass",
                "Poison"
            ]
        },
        "592": {
            "flavor": "If its veil-like arms stun and wrap a foe, that foe will\nbe dragged miles below the surface, never\nto return.",
            "name_en": "frillish",
            "types": [
                "Water",
                "Ghost"
            ]
        },
        "593": {
            "flavor": "The fate of the ships and crew that wander into\nJellicent’s habitat: all sunken, all lost, all vanished.",
            "name_en": "jellicent",
            "types": [
                "Water",
                "Ghost"
            ]
        },
        "594": {
            "flavor": "It gently holds injured and weak Pokémon in its\nfins. Its special membrane heals their wounds.",
            "name_en": "alomomola",
            "types": [
                "Water"
            ]
        },
        "595": {
            "flavor": "They attach themselves to large-bodied Pokémon\nand absorb static electricity, which they store in an\nelectric pouch.",
            "name_en": "joltik",
            "types": [
                "Bug",
                "Electric"
            ]
        },
        "596": {
            "flavor": "When attacked, they create an electric barrier by\nspitting out many electrically charged threads.",
            "name_en": "galvantula",
            "types": [
                "Bug",
                "Electric"
            ]
        },
        "597": {
            "flavor": "It absorbs the iron it finds in the rock while clinging\nto the ceiling. It shoots spikes when in danger.",
            "name_en": "ferroseed",
            "types": [
                "Grass",
                "Steel"
            ]
        },
        "598": {
            "flavor": "They attach themselves to cave ceilings, firing steel\nspikes at targets passing beneath them.",
            "name_en": "ferrothorn",
            "types": [
                "Grass",
                "Steel"
            ]
        },
        "599": {
            "flavor": "The two minigears that mesh together are\npredetermined. Each will rebound from other\nminigears without meshing.",
            "name_en": "klink",
            "types": [
                "Steel"
            ]
        },
        "600": {
            "flavor": "A minigear and big gear comprise its body. If the\nminigear it launches at a foe doesn’t return, it\nwill die.",
            "name_en": "klang",
            "types": [
                "Steel"
            ]
        },
        "601": {
            "flavor": "Its red core functions as an energy tank. It fires the\ncharged energy through its spikes into an area.",
            "name_en": "klinklang",
            "types": [
                "Steel"
            ]
        },
        "602": {
            "flavor": "One alone can emit only a trickle of electricity,\nso a group of them gathers to unleash a powerful\nelectric shock.",
            "name_en": "tynamo",
            "types": [
                "Electric"
            ]
        },
        "603": {
            "flavor": "These Pokémon have a big appetite. When they\nspot their prey, they attack it and paralyze it\nwith electricity.",
            "name_en": "eelektrik",
            "types": [
                "Electric"
            ]
        },
        "604": {
            "flavor": "They crawl out of the ocean using their arms.\nThey will attack prey on shore and immediately drag\nit into the ocean.",
            "name_en": "eelektross",
            "types": [
                "Electric"
            ]
        },
        "605": {
            "flavor": "Rumors of its origin are linked to a UFO crash site\nin the desert 50 years ago.",
            "name_en": "elgyem",
            "types": [
                "Psychic"
            ]
        },
        "606": {
            "flavor": "It uses psychic power to control an opponent’s\nbrain and tamper with its memories.",
            "name_en": "beheeyem",
            "types": [
                "Psychic"
            ]
        },
        "607": {
            "flavor": "Litwick shines a light that absorbs the life energy of\npeople and Pokémon, which becomes the fuel that\nit burns.",
            "name_en": "litwick",
            "types": [
                "Ghost",
                "Fire"
            ]
        },
        "608": {
            "flavor": "It arrives near the moment of death and steals spirit\nfrom the body.",
            "name_en": "lampent",
            "types": [
                "Ghost",
                "Fire"
            ]
        },
        "609": {
            "flavor": "The spirits burned up in its ominous flame lose their\nway and wander this world forever.",
            "name_en": "chandelure",
            "types": [
                "Ghost",
                "Fire"
            ]
        },
        "610": {
            "flavor": "They mark their territory by leaving gashes in trees\nwith their tusks. If a tusk breaks, a new one grows\nin quickly.",
            "name_en": "axew",
            "types": [
                "Dragon"
            ]
        },
        "611": {
            "flavor": "A broken tusk will not grow back, so it diligently\nsharpens its tusks on river rocks after the end of\na battle.",
            "name_en": "fraxure",
            "types": [
                "Dragon"
            ]
        },
        "612": {
            "flavor": "Their sturdy tusks will stay sharp even if used to cut\nsteel beams. These Pokémon are covered in\nhard armor.",
            "name_en": "haxorus",
            "types": [
                "Dragon"
            ]
        },
        "613": {
            "flavor": "Their snot is a barometer of health. When healthy,\ntheir snot is sticky and the power of their ice\nmoves increases.",
            "name_en": "cubchoo",
            "types": [
                "Ice"
            ]
        },
        "614": {
            "flavor": "It freezes its breath to create fangs and claws of ice\nto fight with. Cold northern areas are its habitat.",
            "name_en": "beartic",
            "types": [
                "Ice"
            ]
        },
        "615": {
            "flavor": "They are composed of ice crystals. They capture\nprey with chains of ice, freezing the prey at\n-148 degrees Fahrenheit.",
            "name_en": "cryogonal",
            "types": [
                "Ice"
            ]
        },
        "616": {
            "flavor": "It evolves when bathed in an electric-like energy\nalong with Karrablast. The reason is still unknown.",
            "name_en": "shelmet",
            "types": [
                "Bug"
            ]
        },
        "617": {
            "flavor": "When its body dries out, it weakens. So, to prevent\ndehydration, it wraps itself in many layers of\nthin membrane.",
            "name_en": "accelgor",
            "types": [
                "Bug"
            ]
        },
        "618": {
            "flavor": "It conceals itself in the mud of the seashore.\nThen it waits. When prey touch it, it delivers a jolt\nof electricity.",
            "name_en": "stunfisk",
            "types": [
                "Ground",
                "Electric"
            ]
        },
        "619": {
            "flavor": "In fights, they dominate with onslaughts of flowing,\ncontinuous attacks. With their sharp claws, they\ncut enemies.",
            "name_en": "mienfoo",
            "types": [
                "Fighting"
            ]
        },
        "620": {
            "flavor": "Using the long fur on its arms like whips, it\nlaunches into combo attacks that, once started,\nno one can stop.",
            "name_en": "mienshao",
            "types": [
                "Fighting"
            ]
        },
        "621": {
            "flavor": "It warms its body by absorbing sunlight with its\nwings. When its body temperature falls, it can no\nlonger move.",
            "name_en": "druddigon",
            "types": [
                "Dragon"
            ]
        },
        "622": {
            "flavor": "Ancient science fashioned this Pokémon from clay.\nIt’s been active for thousands of years.",
            "name_en": "golett",
            "types": [
                "Ground",
                "Ghost"
            ]
        },
        "623": {
            "flavor": "It flies across the sky at Mach speeds. Removing\nthe seal on its chest makes its internal energy go\nout of control.",
            "name_en": "golurk",
            "types": [
                "Ground",
                "Ghost"
            ]
        },
        "624": {
            "flavor": "Ignoring their injuries, groups attack by sinking\nthe blades that cover their bodies into their prey.",
            "name_en": "pawniard",
            "types": [
                "Dark",
                "Steel"
            ]
        },
        "625": {
            "flavor": "Bisharp pursues prey in the company of a large\ngroup of Pawniard. Then Bisharp finishes off\nthe prey.",
            "name_en": "bisharp",
            "types": [
                "Dark",
                "Steel"
            ]
        },
        "626": {
            "flavor": "Their fluffy fur absorbs damage, even if they strike\nfoes with a fierce headbutt.",
            "name_en": "bouffalant",
            "types": [
                "Normal"
            ]
        },
        "627": {
            "flavor": "They will challenge anything, even strong\nopponents, without fear. Their frequent fights help\nthem become stronger.",
            "name_en": "rufflet",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "628": {
            "flavor": "They fight for their friends without any thought\nabout danger to themselves. One can carry a car\nwhile flying.",
            "name_en": "braviary",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "629": {
            "flavor": "Their wings are too tiny to allow them to fly.\nThey guard their posteriors with bones that were\ngathered by Mandibuzz.",
            "name_en": "vullaby",
            "types": [
                "Dark",
                "Flying"
            ]
        },
        "630": {
            "flavor": "Watching from the sky, they swoop to strike\nweakened Pokémon on the ground. They decorate\nthemselves with bones.",
            "name_en": "mandibuzz",
            "types": [
                "Dark",
                "Flying"
            ]
        },
        "631": {
            "flavor": "It draws in air through its tail, transforms it into fire,\nand uses it like a tongue. It melts Durant and\neats them.",
            "name_en": "heatmor",
            "types": [
                "Fire"
            ]
        },
        "632": {
            "flavor": "They attack in groups, covering themselves in steel\narmor to protect themselves from Heatmor.",
            "name_en": "durant",
            "types": [
                "Bug",
                "Steel"
            ]
        },
        "633": {
            "flavor": "Lacking sight, it’s unaware of its surroundings,\nso it bumps into things and eats anything\nthat moves.",
            "name_en": "deino",
            "types": [
                "Dark",
                "Dragon"
            ]
        },
        "634": {
            "flavor": "After it has eaten up all the food in its territory,\nit moves to another area. Its two heads do not\nget along.",
            "name_en": "zweilous",
            "types": [
                "Dark",
                "Dragon"
            ]
        },
        "635": {
            "flavor": "It responds to movement by attacking. This scary,\nthree-headed Pokémon devours everything in\nits path!",
            "name_en": "hydreigon",
            "types": [
                "Dark",
                "Dragon"
            ]
        },
        "636": {
            "flavor": "The base of volcanoes is where they make their\nhomes. They shoot fire from their five horns to repel\nattacking enemies.",
            "name_en": "larvesta",
            "types": [
                "Bug",
                "Fire"
            ]
        },
        "637": {
            "flavor": "When volcanic ash darkened the atmosphere, it is\nsaid that Volcarona’s fire provided a replacement\nfor the sun.",
            "name_en": "volcarona",
            "types": [
                "Bug",
                "Fire"
            ]
        },
        "638": {
            "flavor": "It has a body and heart of steel. It worked with its\nallies to punish people when they hurt Pokémon.",
            "name_en": "cobalion",
            "types": [
                "Steel",
                "Fighting"
            ]
        },
        "639": {
            "flavor": "Spoken of in legend, this Pokémon used its\nphenomenal power to destroy a castle in its effort\nto protect Pokémon.",
            "name_en": "terrakion",
            "types": [
                "Rock",
                "Fighting"
            ]
        },
        "640": {
            "flavor": "Legends say this Pokémon confounded opponents\nwith its swift movements.",
            "name_en": "virizion",
            "types": [
                "Grass",
                "Fighting"
            ]
        },
        "641": {
            "flavor": "Tornadus expels massive energy from its tail,\ncausing severe storms. Its power is great enough\nto blow houses away.",
            "name_en": "tornadus",
            "types": [
                "Flying"
            ]
        },
        "642": {
            "flavor": "As it flies around, it shoots lightning all over\nthe place and causes forest fires. It is\ntherefore disliked.",
            "name_en": "thundurus",
            "types": [
                "Electric",
                "Flying"
            ]
        },
        "643": {
            "flavor": "When Reshiram’s tail flares, the heat energy moves\nthe atmosphere and changes the world’s weather.",
            "name_en": "reshiram",
            "types": [
                "Dragon",
                "Fire"
            ]
        },
        "644": {
            "flavor": "Concealing itself in lightning clouds, it flies\nthroughout the Unova region. It creates electricity\nin its tail.",
            "name_en": "zekrom",
            "types": [
                "Dragon",
                "Electric"
            ]
        },
        "645": {
            "flavor": "From the forces of lightning and wind, it creates\nenergy to give nutrients to the soil and make the\nland abundant.",
            "name_en": "landorus",
            "types": [
                "Ground",
                "Flying"
            ]
        },
        "646": {
            "flavor": "It generates a powerful, freezing energy inside\nitself, but its body became frozen when the energy\nleaked out.",
            "name_en": "kyurem",
            "types": [
                "Dragon",
                "Ice"
            ]
        },
        "647": {
            "flavor": "When it is resolute, its body fills with power and it\nbecomes swifter. Its jumps are then too fast\nto follow.",
            "name_en": "keldeo",
            "types": [
                "Water",
                "Fighting"
            ]
        },
        "648": {
            "flavor": "Its melodies are sung with a special vocalization\nmethod that can control the feelings of those who\nhear it.",
            "name_en": "meloetta",
            "types": [
                "Normal",
                "Psychic"
            ]
        },
        "649": {
            "flavor": "This Pokémon existed 300 million years ago. Team\nPlasma altered it and attached a cannon to its back.",
            "name_en": "genesect",
            "types": [
                "Bug",
                "Steel"
            ]
        },
        "650": {
            "flavor": "Such a thick shell of wood covers its head and back\nthat even a direct hit from a truck wouldn’t faze it.",
            "name_en": "chespin",
            "types": [
                "Grass"
            ]
        },
        "651": {
            "flavor": "They strengthen their lower bodies by\nrunning into one another. They are very\nkind and won’t start fights.",
            "name_en": "quilladin",
            "types": [
                "Grass"
            ]
        },
        "652": {
            "flavor": "When it takes a defensive posture with its fists\nguarding its face, it could withstand a bomb blast.",
            "name_en": "chesnaught",
            "types": [
                "Grass",
                "Fighting"
            ]
        },
        "653": {
            "flavor": "As it walks, it munches on a twig in place\nof a snack. It intimidates opponents\nby puffing hot air out of its ears.",
            "name_en": "fennekin",
            "types": [
                "Fire"
            ]
        },
        "654": {
            "flavor": "When the twig is plucked from its tail,\nfriction sets the twig alight. The flame\nis used to send signals to its allies.",
            "name_en": "braixen",
            "types": [
                "Fire"
            ]
        },
        "655": {
            "flavor": "Using psychic power, it generates a\nfiery vortex of 5,400 degrees Fahrenheit,\nincinerating foes swept into this whirl of flame.",
            "name_en": "delphox",
            "types": [
                "Fire",
                "Psychic"
            ]
        },
        "656": {
            "flavor": "It protects its skin by covering its body in\ndelicate bubbles. Beneath its happy-go-lucky air,\nit keeps a watchful eye on its surroundings.",
            "name_en": "froakie",
            "types": [
                "Water"
            ]
        },
        "657": {
            "flavor": "Its swiftness is unparalleled.\nIt can scale a tower of more\nthan 2,000 feet in a minute’s time.",
            "name_en": "frogadier",
            "types": [
                "Water"
            ]
        },
        "658": {
            "flavor": "It appears and vanishes with a ninja’s grace.\nIt toys with its enemies using swift movements, while\nslicing them with throwing stars of sharpest water.",
            "name_en": "greninja",
            "types": [
                "Water",
                "Dark"
            ]
        },
        "659": {
            "flavor": "It has ears like shovels. Digging holes\nstrengthens its ears so much that they\ncan sever thick roots effortlessly.",
            "name_en": "bunnelby",
            "types": [
                "Normal"
            ]
        },
        "660": {
            "flavor": "As powerful as an excavator, its ears\ncan reduce dense bedrock to rubble.\nWhen it’s finished digging, it lounges lazily.",
            "name_en": "diggersby",
            "types": [
                "Normal",
                "Ground"
            ]
        },
        "661": {
            "flavor": "Despite the beauty of its lilting voice, it’s\nmerciless to intruders that enter its territory.",
            "name_en": "fletchling",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "662": {
            "flavor": "The hotter the flame sac on its belly,\nthe faster it can fly, but it takes some\ntime to get the fire going.",
            "name_en": "fletchinder",
            "types": [
                "Fire",
                "Flying"
            ]
        },
        "663": {
            "flavor": "When attacking prey, it can reach speeds\nof up to 310 mph. It finishes its prey off\nwith a colossal kick.",
            "name_en": "talonflame",
            "types": [
                "Fire",
                "Flying"
            ]
        },
        "664": {
            "flavor": "The powder that covers its body\nregulates its temperature, so it\ncan live in any region or climate.",
            "name_en": "scatterbug",
            "types": [
                "Bug"
            ]
        },
        "665": {
            "flavor": "The beaks of bird Pokémon can’t begin\nto scratch its stalwart body.\nTo defend itself, it spews powder.",
            "name_en": "spewpa",
            "types": [
                "Bug"
            ]
        },
        "666": {
            "flavor": "The patterns on this Pokémon’s wings\ndepend on the climate and topography\nof its habitat. It scatters colorful scales.",
            "name_en": "vivillon",
            "types": [
                "Bug",
                "Flying"
            ]
        },
        "667": {
            "flavor": "They set off on their own from their pride\nand live by themselves to become stronger.\nThese hot-blooded Pokémon are quick to fight.",
            "name_en": "litleo",
            "types": [
                "Fire",
                "Normal"
            ]
        },
        "668": {
            "flavor": "With fiery breath of more than 10,000 degrees\nFahrenheit, they viciously threaten any challenger.\nThe females protect the pride’s cubs.",
            "name_en": "pyroar",
            "types": [
                "Fire",
                "Normal"
            ]
        },
        "669": {
            "flavor": "When it finds a flower it likes, it dwells on\nthat flower its whole life long. It floats in the\nwind’s embrace with an untroubled heart.",
            "name_en": "flabÃ©bÃ©",
            "types": [
                "Fairy"
            ]
        },
        "670": {
            "flavor": "When the flowers of a well-tended flower bed bloom,\nit appears and celebrates with an elegant dance.",
            "name_en": "floette",
            "types": [
                "Fairy"
            ]
        },
        "671": {
            "flavor": "In times long past, governors of castles\nwould invite Florges to create flower gardens\nto embellish the castle domains.",
            "name_en": "florges",
            "types": [
                "Fairy"
            ]
        },
        "672": {
            "flavor": "If it has sunshine and water, it doesn’t\nneed to eat, because it can generate\nenergy from the leaves on its back.",
            "name_en": "skiddo",
            "types": [
                "Grass"
            ]
        },
        "673": {
            "flavor": "They inhabit mountainous regions.\nThe leader of the herd is decided by\na battle of clashing horns.",
            "name_en": "gogoat",
            "types": [
                "Grass"
            ]
        },
        "674": {
            "flavor": "It does its level best to glare and pull a scary face,\nbut it can’t help grinning if anyone pats its head.",
            "name_en": "pancham",
            "types": [
                "Fighting"
            ]
        },
        "675": {
            "flavor": "It charges ahead and bashes its opponents like\na berserker, uncaring about any hits it might take.\nIts arms are mighty enough to snap a telephone pole.",
            "name_en": "pangoro",
            "types": [
                "Fighting",
                "Dark"
            ]
        },
        "676": {
            "flavor": "Historically, in the Kalos region, these Pokémon\nwere the designated guardians of the king.",
            "name_en": "furfrou",
            "types": [
                "Normal"
            ]
        },
        "677": {
            "flavor": "It has enough psychic energy to blast\neverything within 300 feet of itself,\nbut it has no control over its power.",
            "name_en": "espurr",
            "types": [
                "Psychic"
            ]
        },
        "678": {
            "flavor": "The eyeball patterns on the interior of its ears\nemit psychic energy. It keeps the patterns tightly\ncovered because that power is too immense.",
            "name_en": "meowstic",
            "types": [
                "Psychic"
            ]
        },
        "679": {
            "flavor": "If anyone dares to grab its hilt, it wraps\na blue cloth around that person’s arm and\ndrains that person’s life energy completely.",
            "name_en": "honedge",
            "types": [
                "Steel",
                "Ghost"
            ]
        },
        "680": {
            "flavor": "The complex attack patterns of its two swords\nare unstoppable, even for an opponent\ngreatly accomplished at swordplay.",
            "name_en": "doublade",
            "types": [
                "Steel",
                "Ghost"
            ]
        },
        "681": {
            "flavor": "Apparently, it can detect the innate qualities\nof leadership. According to legend, whoever it\nrecognizes is destined to become king.",
            "name_en": "aegislash",
            "types": [
                "Steel",
                "Ghost"
            ]
        },
        "682": {
            "flavor": "In the past, rather than using perfume,\nroyal ladies carried a Spritzee\nthat would waft a fragrance they liked.",
            "name_en": "spritzee",
            "types": [
                "Fairy"
            ]
        },
        "683": {
            "flavor": "Its scent is so overpowering that, unless a Trainer\nhappens to really enjoy the smell, he or she will\nhave a hard time walking alongside it.",
            "name_en": "aromatisse",
            "types": [
                "Fairy"
            ]
        },
        "684": {
            "flavor": "Because it eats nothing but sweets,\nits fur is as sticky sweet as cotton candy.",
            "name_en": "swirlix",
            "types": [
                "Fairy"
            ]
        },
        "685": {
            "flavor": "Its sense of smell is 100 million times better than\na human’s, so even the faintest scent tells it about\neverything in the area. It’s like it can see with its nose!",
            "name_en": "slurpuff",
            "types": [
                "Fairy"
            ]
        },
        "686": {
            "flavor": "It flashes the light-emitting spots on its body,\nwhich drains its opponent’s will to fight.\nIt takes the opportunity to scuttle away and hide.",
            "name_en": "inkay",
            "types": [
                "Dark",
                "Psychic"
            ]
        },
        "687": {
            "flavor": "It lures its prey close with hypnotic motions,\nthen wraps its tentacles around it before\nfinishing it off with digestive fluids.",
            "name_en": "malamar",
            "types": [
                "Dark",
                "Psychic"
            ]
        },
        "688": {
            "flavor": "They stretch and then contract, yanking their\nrocks along with them in bold hops. They eat\nseaweed that washes up on the shoreline.",
            "name_en": "binacle",
            "types": [
                "Rock",
                "Water"
            ]
        },
        "689": {
            "flavor": "Barbaracle’s legs and hands have minds\nof their own, and they will move independently.\nBut they usually follow the head’s orders.",
            "name_en": "barbaracle",
            "types": [
                "Rock",
                "Water"
            ]
        },
        "690": {
            "flavor": "It looks just like rotten kelp. It hides from foes\nwhile storing up power for its evolution.",
            "name_en": "skrelp",
            "types": [
                "Poison",
                "Water"
            ]
        },
        "691": {
            "flavor": "Tales are told of ships that wander into\nseas where Dragalge live, never to return.",
            "name_en": "dragalge",
            "types": [
                "Poison",
                "Dragon"
            ]
        },
        "692": {
            "flavor": "Through controlled explosions of internal gas,\nit can expel water like a pistol shot.\nAt close distances, it can shatter rock.",
            "name_en": "clauncher",
            "types": [
                "Water"
            ]
        },
        "693": {
            "flavor": "By expelling water from the nozzle in the back\nof its claw, it can move at a speed of 60 knots.",
            "name_en": "clawitzer",
            "types": [
                "Water"
            ]
        },
        "694": {
            "flavor": "The frills on either side of its head have cells\nthat generate electricity when exposed to sunlight.",
            "name_en": "helioptile",
            "types": [
                "Electric",
                "Normal"
            ]
        },
        "695": {
            "flavor": "It stimulates its muscles with electricity,\nboosting the strength in its legs and enabling\nit to run 100 yards in five seconds.",
            "name_en": "heliolisk",
            "types": [
                "Electric",
                "Normal"
            ]
        },
        "696": {
            "flavor": "Its immense jaws have enough destructive\nforce that it can chew up an automobile.\nIt lived 100 million years ago.",
            "name_en": "tyrunt",
            "types": [
                "Rock",
                "Dragon"
            ]
        },
        "697": {
            "flavor": "Nothing could stop this Pokémon\n100 million years ago,\nso it behaved like a king.",
            "name_en": "tyrantrum",
            "types": [
                "Rock",
                "Dragon"
            ]
        },
        "698": {
            "flavor": "This calm Pokémon lived in a cold land where\nthere were no violent predators like Tyrantrum.",
            "name_en": "amaura",
            "types": [
                "Rock",
                "Ice"
            ]
        },
        "699": {
            "flavor": "Using its diamond-shaped crystals,\nit can instantly create a wall of\nice to block an opponent’s attack.",
            "name_en": "aurorus",
            "types": [
                "Rock",
                "Ice"
            ]
        },
        "700": {
            "flavor": "It wraps its ribbonlike feelers around\nthe arm of its beloved Trainer\nand walks with him or her.",
            "name_en": "sylveon",
            "types": [
                "Fairy"
            ]
        },
        "701": {
            "flavor": "With its wings, it controls its position in the air.\nIt likes to attack from above, a maneuver that\nis difficult to defend against.",
            "name_en": "hawlucha",
            "types": [
                "Fighting",
                "Flying"
            ]
        },
        "702": {
            "flavor": "It uses its tail to absorb electricity from\npower plants or from outlets in houses,\nand then it fires the electricity from its whiskers.",
            "name_en": "dedenne",
            "types": [
                "Electric",
                "Fairy"
            ]
        },
        "703": {
            "flavor": "It has slept underground for hundreds of millions\nof years since its birth. It’s occasionally found\nduring the excavation of caves.",
            "name_en": "carbink",
            "types": [
                "Rock",
                "Fairy"
            ]
        },
        "704": {
            "flavor": "It’s covered in a slimy membrane that makes\nany punches or kicks slide off it harmlessly.",
            "name_en": "goomy",
            "types": [
                "Dragon"
            ]
        },
        "705": {
            "flavor": "Its four horns are a high-performance radar system.\nIt uses them to sense sounds and smells,\nrather than using ears or a nose.",
            "name_en": "sliggoo",
            "types": [
                "Dragon"
            ]
        },
        "706": {
            "flavor": "It attacks with retractable horns.\nIt throws a punch that’s the equivalent\nof the force of a hundred pro boxers.",
            "name_en": "goodra",
            "types": [
                "Dragon"
            ]
        },
        "707": {
            "flavor": "It never lets go of a key that it likes,\nso people give it the keys to vaults and\nsafes as a way to prevent crime.",
            "name_en": "klefki",
            "types": [
                "Steel",
                "Fairy"
            ]
        },
        "708": {
            "flavor": "According to old tales, these Pokémon are\nstumps possessed by the spirits of\nchildren who died while lost in the forest.",
            "name_en": "phantump",
            "types": [
                "Ghost",
                "Grass"
            ]
        },
        "709": {
            "flavor": "Using its roots as a nervous system,\nit controls the trees in the forest.\nIt’s kind to the Pokémon that reside in its body.",
            "name_en": "trevenant",
            "types": [
                "Ghost",
                "Grass"
            ]
        },
        "710": {
            "flavor": "It is said to carry wandering spirits\nto the place where they belong\nso they can move on.",
            "name_en": "pumpkaboo",
            "types": [
                "Ghost",
                "Grass"
            ]
        },
        "711": {
            "flavor": "It enwraps its prey in its hairlike arms.\nIt sings joyfully as it observes the\nsuffering of its prey.",
            "name_en": "gourgeist",
            "types": [
                "Ghost",
                "Grass"
            ]
        },
        "712": {
            "flavor": "Using air of -150 degrees Fahrenheit, they\nfreeze opponents solid. They live in herds\nabove the snow line on mountains.",
            "name_en": "bergmite",
            "types": [
                "Ice"
            ]
        },
        "713": {
            "flavor": "The way several Bergmite huddle\non its back makes it look like\nan aircraft carrier made of ice.",
            "name_en": "avalugg",
            "types": [
                "Ice"
            ]
        },
        "714": {
            "flavor": "Even a robust wrestler will become\ndizzy and unable to stand when exposed\nto its 200,000-hertz ultrasonic waves.",
            "name_en": "noibat",
            "types": [
                "Flying",
                "Dragon"
            ]
        },
        "715": {
            "flavor": "The ultrasonic waves it emits from its ears\ncan reduce a large boulder to pebbles.\nIt swoops out of the dark to attack.",
            "name_en": "noivern",
            "types": [
                "Flying",
                "Dragon"
            ]
        },
        "716": {
            "flavor": "When the horns on its head shine\nin seven colors, it is said to be\nsharing everlasting life.",
            "name_en": "xerneas",
            "types": [
                "Fairy"
            ]
        },
        "717": {
            "flavor": "When its life comes to an end, it absorbs\nthe life energy of every living thing\nand turns into a cocoon once more.",
            "name_en": "yveltal",
            "types": [
                "Dark",
                "Flying"
            ]
        },
        "718": {
            "flavor": "It’s hypothesized that it’s monitoring\nthose who destroy the ecosystem\nfrom deep in the cave where it lives.",
            "name_en": "zygarde",
            "types": [
                "Dragon",
                "Ground"
            ]
        },
        "719": {
            "flavor": "It can instantly create many diamonds\nby compressing the carbon in the air\nbetween its hands.",
            "name_en": "diancie",
            "types": [
                "Rock",
                "Fairy"
            ]
        },
        "720": {
            "flavor": "It is said to be able to seize anything it desires\nwith its six rings and six huge arms. With its power\nsealed, it is transformed into a much smaller form.",
            "name_en": "hoopa",
            "types": [
                "Psychic",
                "Ghost"
            ]
        },
        "721": {
            "flavor": "It expels its internal steam from the\narms on its back. It has enough\npower to blow away a mountain.",
            "name_en": "volcanion",
            "types": [
                "Fire",
                "Water"
            ]
        },
        "722": {
            "name_en": "rowlet",
            "types": [
                "Grass",
                "Flying"
            ]
        },
        "723": {
            "name_en": "dartrix",
            "types": [
                "Grass",
                "Flying"
            ]
        },
        "724": {
            "name_en": "decidueye",
            "types": [
                "Grass",
                "Ghost"
            ]
        },
        "725": {
            "name_en": "litten",
            "types": [
                "Fire"
            ]
        },
        "726": {
            "name_en": "torracat",
            "types": [
                "Fire"
            ]
        },
        "727": {
            "name_en": "incineroar",
            "types": [
                "Fire",
                "Dark"
            ]
        },
        "728": {
            "name_en": "popplio",
            "types": [
                "Water"
            ]
        },
        "729": {
            "name_en": "brionne",
            "types": [
                "Water"
            ]
        },
        "730": {
            "name_en": "primarina",
            "types": [
                "Water",
                "Fairy"
            ]
        },
        "731": {
            "name_en": "pikipek",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "732": {
            "name_en": "trumbeak",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "733": {
            "name_en": "toucannon",
            "types": [
                "Normal",
                "Flying"
            ]
        },
        "734": {
            "name_en": "yungoos",
            "types": [
                "Normal"
            ]
        },
        "735": {
            "name_en": "gumshoos",
            "types": [
                "Normal"
            ]
        },
        "736": {
            "name_en": "grubbin",
            "types": [
                "Bug"
            ]
        },
        "737": {
            "name_en": "charjabug",
            "types": [
                "Bug",
                "Electric"
            ]
        },
        "738": {
            "name_en": "vikavolt",
            "types": [
                "Bug",
                "Electric"
            ]
        },
        "739": {
            "name_en": "crabrawler",
            "types": [
                "Fighting"
            ]
        },
        "740": {
            "name_en": "crabominable",
            "types": [
                "Fighting",
                "Ice"
            ]
        },
        "741": {
            "name_en": "oricorio",
            "types": [
                "Fire",
                "Flying"
            ]
        },
        "742": {
            "name_en": "cutiefly",
            "types": [
                "Bug",
                "Fairy"
            ]
        },
        "743": {
            "name_en": "ribombee",
            "types": [
                "Bug",
                "Fairy"
            ]
        },
        "744": {
            "name_en": "rockruff",
            "types": [
                "Rock"
            ]
        },
        "745": {
            "name_en": "lycanroc",
            "types": [
                "Rock"
            ]
        },
        "746": {
            "name_en": "wishiwashi",
            "types": [
                "Water"
            ]
        },
        "747": {
            "name_en": "mareanie",
            "types": [
                "Poison",
                "Water"
            ]
        },
        "748": {
            "name_en": "toxapex",
            "types": [
                "Poison",
                "Water"
            ]
        },
        "749": {
            "name_en": "mudbray",
            "types": [
                "Ground"
            ]
        },
        "750": {
            "name_en": "mudsdale",
            "types": [
                "Ground"
            ]
        },
        "751": {
            "name_en": "dewpider",
            "types": [
                "Water",
                "Bug"
            ]
        },
        "752": {
            "name_en": "araquanid",
            "types": [
                "Water",
                "Bug"
            ]
        },
        "753": {
            "name_en": "fomantis",
            "types": [
                "Grass"
            ]
        },
        "754": {
            "name_en": "lurantis",
            "types": [
                "Grass"
            ]
        },
        "755": {
            "name_en": "morelull",
            "types": [
                "Grass",
                "Fairy"
            ]
        },
        "756": {
            "name_en": "shiinotic",
            "types": [
                "Grass",
                "Fairy"
            ]
        },
        "757": {
            "name_en": "salandit",
            "types": [
                "Poison",
                "Fire"
            ]
        },
        "758": {
            "name_en": "salazzle",
            "types": [
                "Poison",
                "Fire"
            ]
        },
        "759": {
            "name_en": "stufful",
            "types": [
                "Normal",
                "Fighting"
            ]
        },
        "760": {
            "name_en": "bewear",
            "types": [
                "Normal",
                "Fighting"
            ]
        },
        "761": {
            "name_en": "bounsweet",
            "types": [
                "Grass"
            ]
        },
        "762": {
            "name_en": "steenee",
            "types": [
                "Grass"
            ]
        },
        "763": {
            "name_en": "tsareena",
            "types": [
                "Grass"
            ]
        },
        "764": {
            "name_en": "comfey",
            "types": [
                "Fairy"
            ]
        },
        "765": {
            "name_en": "oranguru",
            "types": [
                "Normal",
                "Psychic"
            ]
        },
        "766": {
            "name_en": "passimian",
            "types": [
                "Fighting"
            ]
        },
        "767": {
            "name_en": "wimpod",
            "types": [
                "Bug",
                "Water"
            ]
        },
        "768": {
            "name_en": "golisopod",
            "types": [
                "Bug",
                "Water"
            ]
        },
        "769": {
            "name_en": "sandygast",
            "types": [
                "Ghost",
                "Ground"
            ]
        },
        "770": {
            "name_en": "palossand",
            "types": [
                "Ghost",
                "Ground"
            ]
        },
        "771": {
            "name_en": "pyukumuku",
            "types": [
                "Water"
            ]
        },
        "772": {
            "name_en": "type: null",
            "types": [
                "Normal"
            ]
        },
        "773": {
            "name_en": "silvally",
            "types": [
                "Normal"
            ]
        },
        "774": {
            "name_en": "minior",
            "types": [
                "Rock",
                "Flying"
            ]
        },
        "775": {
            "name_en": "komala",
            "types": [
                "Normal"
            ]
        },
        "776": {
            "name_en": "turtonator",
            "types": [
                "Fire",
                "Dragon"
            ]
        },
        "777": {
            "name_en": "togedemaru",
            "types": [
                "Electric",
                "Steel"
            ]
        },
        "778": {
            "name_en": "mimikyu",
            "types": [
                "Ghost",
                "Fairy"
            ]
        },
        "779": {
            "name_en": "bruxish",
            "types": [
                "Water",
                "Psychic"
            ]
        },
        "780": {
            "name_en": "drampa",
            "types": [
                "Normal",
                "Dragon"
            ]
        },
        "781": {
            "name_en": "dhelmise",
            "types": [
                "Ghost",
                "Grass"
            ]
        },
        "782": {
            "name_en": "jangmo-o",
            "types": [
                "Dragon"
            ]
        },
        "783": {
            "name_en": "hakamo-o",
            "types": [
                "Dragon",
                "Fighting"
            ]
        },
        "784": {
            "name_en": "kommo-o",
            "types": [
                "Dragon",
                "Fighting"
            ]
        },
        "785": {
            "name_en": "tapu koko",
            "types": [
                "Electric",
                "Fairy"
            ]
        },
        "786": {
            "name_en": "tapu lele",
            "types": [
                "Psychic",
                "Fairy"
            ]
        },
        "787": {
            "name_en": "tapu bulu",
            "types": [
                "Grass",
                "Fairy"
            ]
        },
        "788": {
            "name_en": "tapu fini",
            "types": [
                "Water",
                "Fairy"
            ]
        },
        "789": {
            "name_en": "cosmog",
            "types": [
                "Psychic"
            ]
        },
        "790": {
            "name_en": "cosmoem",
            "types": [
                "Psychic"
            ]
        },
        "791": {
            "name_en": "solgaleo",
            "types": [
                "Psychic",
                "Steel"
            ]
        },
        "792": {
            "name_en": "lunala",
            "types": [
                "Psychic",
                "Ghost"
            ]
        },
        "793": {
            "name_en": "nihilego",
            "types": [
                "Rock",
                "Poison"
            ]
        },
        "794": {
            "name_en": "buzzwole",
            "types": [
                "Bug",
                "Fighting"
            ]
        },
        "795": {
            "name_en": "pheromosa",
            "types": [
                "Bug",
                "Fighting"
            ]
        },
        "796": {
            "name_en": "xurkitree",
            "types": [
                "Electric"
            ]
        },
        "797": {
            "name_en": "celesteela",
            "types": [
                "Steel",
                "Flying"
            ]
        },
        "798": {
            "name_en": "kartana",
            "types": [
                "Grass",
                "Steel"
            ]
        },
        "799": {
            "name_en": "guzzlord",
            "types": [
                "Dark",
                "Dragon"
            ]
        },
        "800": {
            "name_en": "necrozma",
            "types": [
                "Psychic"
            ]
        },
        "801": {
            "name_en": "magearna",
            "types": [
                "Steel",
                "Fairy"
            ]
        }
    },
    "type_chart": {
        "Bug": {
            "Fighting": 0.714,
            "Fire": 1.4,
            "Flying": 1.4,
            "Grass": 0.714,
            "Ground": 0.714,
            "Rock": 1.4
        },
        "Dark": {
            "Bug": 1.4,
            "Dark": 0.714,
            "Fairy": 1.4,
            "Fighting": 1.4,
            "Ghost": 0.714,
            "Psychic": 0.51
        },
        "Dragon": {
            "Dragon": 1.4,
            "Electric": 0.714,
            "Fairy": 1.4,
            "Fire": 0.714,
            "Grass": 0.714,
            "Ice": 1.4,
            "Water": 0.714
        },
        "Electric": {
            "Electric": 0.714,
            "Flying": 0.714,
            "Ground": 1.4,
            "Steel": 0.714
        },
        "Fairy": {
            "Bug": 0.714,
            "Dark": 0.714,
            "Dragon": 0.51,
            "Fighting": 0.714,
            "Poison": 1.4,
            "Steel": 1.4
        },
        "Fighting": {
            "Bug": 0.714,
            "Dark": 0.714,
            "Fairy": 1.4,
            "Flying": 1.4,
            "Psychic": 1.4,
            "Rock": 0.714
        },
        "Fire": {
            "Bug": 0.714,
            "Fairy": 0.714,
            "Fire": 0.714,
            "Grass": 0.714,
            "Ground": 1.4,
            "Ice": 0.714,
            "Rock": 1.4,
            "Steel": 0.714,
            "Water": 1.4
        },
        "Flying": {
            "Bug": 0.714,
            "Electric": 1.4,
            "Fighting": 0.714,
            "Grass": 0.714,
            "Ground": 0.51,
            "Ice": 1.4,
            "Rock": 1.4
        },
        "Ghost": {
            "Bug": 0.714,
            "Dark": 1.4,
            "Fighting": 0.51,
            "Ghost": 1.4,
            "Normal": 0.51,
            "Poison": 0.714
        },
        "Grass": {
            "Bug": 1.4,
            "Electric": 0.714,
            "Fire": 1.4,
            "Flying": 1.4,
            "Grass": 0.714,
            "Ground": 0.714,
            "Ice": 1.4,
            "Poison": 1.4,
            "Water": 0.714
        },
        "Ground": {
            "Electric": 0.51,
            "Grass": 1.4,
            "Ice": 1.4,
            "Poison": 0.714,
            "Rock": 0.714,
            "Water": 1.4
        },
        "Ice": {
            "Fighting": 1.4,
            "Fire": 1.4,
            "Ice": 0.714,
            "Rock": 1.4,
            "Steel": 1.4
        },
        "Normal": {
            "Fighting": 1.4,
            "Ghost": 0.51
        },
        "Poison": {
            "Bug": 0.714,
            "Fairy": 0.714,
            "Fighting": 0.714,
            "Grass": 0.714,
            "Ground": 1.4,
            "Poison": 0.714,
            "Psychic": 1.4
        },
        "Psychic": {
            "Bug": 1.4,
            "Dark": 1.4,
            "Fighting": 0.714,
            "Ghost": 1.4,
            "Psychic": 0.714
        },
        "Rock": {
            "Fighting": 1.4,
            "Fire": 0.714,
            "Flying": 0.714,
            "Grass": 1.4,
            "Ground": 1.4,
            "Normal": 0.714,
            "Poison": 0.714,
            "Steel": 1.4,
            "Water": 1.4
        },
        "Steel": {
            "Bug": 0.714,
            "Dragon": 0.714,
            "Fairy": 0.714,
            "Fighting": 1.4,
            "Fire": 1.4,
            "Flying": 0.714,
            "Grass": 0.714,
            "Ground": 1.4,
            "Ice": 0.714,
            "Normal": 0.714,
            "Poison": 0.51,
            "Psychic": 0.714,
            "Rock": 0.714,
            "Steel": 0.714
        },
        "Water": {
            "Electric": 1.4,
            "Fire": 0.714,
            "Grass": 1.4,
            "Ice": 0.714,
            "Steel": 0.714,
            "Water": 0.714
        }
    }
}